[
  {
    "id": 1,
    "slug": "breeding",
    "title": "Pokemon Breeding",
    "subtitle": "A Guide for Beginners and Experts",
    "description": "An extensive guide for players new to pokemon breeding, and to those who wish to get into more advanced pokemon breeding. If you have a suggestion for an edit, or more information to add, feel free to message the staff that made the post",
    "author": "AmaTheGoodra",
    "body": "# Pokemon Breeding\n\n## A Guide for Beginners and Experts\n\n*Guide Submitted By AmaTheGoodra*\n\nAn extensive guide for players new to pokemon breeding, and to those who wish to get into more advanced pokemon breeding. If you have a suggestion for an edit, or more information to add, feel free to message the staff that made the post\n\n---\n\nThis is a detailed guide on both the fundamentals to pokemon breeding, and how to go further to professionally breed BP pokemon. This guide is intended for players who have no information on breeding pokemon on Cobblemon Delta, to those who wish to move onto more advanced pokemon breeding. Breeding takes time and patience to get the desired results.\n\n## How to Get Started\n\nTo get started you can use /daycare or use the (,<) keybind that comes with the modpack. Alternatively, you can also access the daycare with a poketch by using the poketch, and the daycare option should be on the top left corner. This is your main way of accessing the daycare. Keep in mind that there are certain servers that do not allow access to the daycare, such as dungeons and ultra wormholes. You also won't be able to access the daycare when in a pokemon battle. When you open up the daycare you will be greeted with the following UI:\n\nAs you can see, you start out with one pen. You can unlock pens 2 and 3 with 200,000 PokeDollars, and the same applies to 4, 5, and 6 as well, but the latter are only accessible via the Origin, Zenith & Delta ranks respectively. This is not necessary to get into breeding, and you can comfortably start breeding with the first 3 slots.\n\n## Using the Breeding System\n\nAbove is an infographic on how to use specific parts of the daycare UI, and you can find some additional information below:\n\n- Left Click one of the pens in order to change pens\n- Left Click on the pokeball to add a pokemon to the daycare\n- Right Click the pokemon to remove the pokemon from the daycare\n- Left Click the pokemon and then choose a pokemon in your party to replace the one in the daycare\n- When an egg is ready, an egg will appear in place of the exclamation mark. Left Click the egg to move the egg to your egg backpack in order for it to begin hatching\n- You will receive both a sound and message notification for when an egg is ready, as well as when one has hatched in your backpack\n\n**Notes:**\n- Keep in mind your backpack has a limit so it can get full, meaning any newly prepared eggs cannot be put into your backpack (There currently is no way to increase this limit)\n- The system is strictly timed based and doesn't involve moving around to hatch eggs\n\n## Breeding Basics\n\nWhen it comes to breeding, you can have one Male and one Female breed as you can't breed with two males or two females. The female pokemon determines the species of the pokemon.\n\n**Example:**\nIf you have a female Goomy and breed it with a male Dratini then the offspring will always be a Goomy.\n\n## Pokemon Egg Groups\n\nAnother important aspect of breeding is that both pokemon must share at least one egg group in order to create eggs. This acts as the core to breeding, and you can find all the egg groups listed below:\n\nIdeally you want to use pokemon that have two egg groups in order to cover your bases and breed pokemon with as little resources necessary. The only groups you can't breed with are the \"No Eggs Discovered\" and certain pokemon in the \"Gender Unknown\" group. Those Pokemon are typically Legendaries (Manaphy/Phione are excluded, but you cannot breed either of these two pokemon on the server), Mythicals, Paradoxes, and Fusion Pokemon. Baby Pokemon, such as togepi, riolu, and magby, also cannot be used for breeding, but can be obtained from eggs via breeding using their evolutions.\n\nYou can check the pokemon's egg group via the in-game pokedex via the /pokedex search [pokemon name] command and clicking on the egg icon (use the infographic below for reference), googling the pokemon and going to either their \"Bulbapedia\" or \"PokemonDatabase\" page. You can also find the egg groups of the custom pokemon via their custom pokemon page on the Discord.\n\n**Note:** All Delta/Ultra/Custom Pokemon have the same egg group as their normal counterparts. For example, Ultra Snivy is in the Field and Grass egg groups, just like Regular Snivy.\n\n### Ideal Pokemon for Egg Group Coverage\n\nHere is the ideal list of pokemon you want in order to cover all egg groups:\n\n- **Dwebble** – Bug/Mineral\n- **Magikarp** – Water2/Dragon\n- **Delta Marill** – Fairy/Water 1\n  - Be sure to evolve Delta Azurill into one via friendship as Azurill are baby pokemon and unbreedable\n- **Chimchar/Buneary** – Field/Humanlike\n- **Archen** – Flying/Water 3\n- **Phantump** – Grass/Amorphous\n- **Treecko/Charmander** - Monster/Dragon\n- **Ditto** - Gender Unknown\n\nYou'll want these pokemon to have 6 perfect IVs (every IV = 31) (You cannot get 6IV Ditto, so aim to have multiple Ditto with at least one perfect IV of each stat) in order to have an easier time breeding.\n\n## Advanced Breeding\n\nNow that you have a general understanding on how breeding works, we can move on to the more advanced specifics to breeding. Before we do, here are a few common terms that we'll be using frequently in this guide, and that are used often in-game:\n\n| Term | Definition |\n|------|------------|\n| BP | Battle Perfect (For competitive battling, such as Elite 4 battles, ranked, and tournaments) |\n| IVS | Individual Values (This is what you're breeding for) |\n| (x) (stat) | You're having a specific IV of that specific stat (Example 0IV SPE, 31IV ATK) |\n| HP/ATK/DEF/SPATK/SPDEF/SPE | The stats mentioned above |\n| Hidden Power/HP | The type of the move \"Hidden Power\" based on the pokemon's IV spread. You can see what IVs are needed for specific HP types via: https://www.ppobuddy.com/tools/hidden-power |\n| Golden/Rusty/Silver Bottlecap | Items used to change the \"IVs\" of your pokemon |\n| Abilities | The \"Ability/ies\" of the pokemon |\n| Hidden Abilities | The special \"Ability\" of the pokemon that are more difficult to obtain than their regular abilities |\n| Ability Capsules/Ability Patches | Items that can change the \"Ability\" of a pokemon |\n| Nature | The current \"Nature\" of the pokemon |\n| Mints | Items used to change the nature of a pokemon. A pokemon that has had their nature changed via a mint will not be able to pass down that nature, and will instead only be capable of passing down its original nature |\n| Egg Moves | Moves that can only be passed down via Breeding if the pokemon involved have those moves in their current move set. Egg moves can be passed down without breeding and this method will be discussed further down |\n| TMs/Tutor Moves | Moves that can be taught to a pokemon via the NPC at /warp tms |\n| Gender Ratios | The percentage of a pokemon's lean towards being female or male |\n| Neutered pokemon | Unable to breed, while Non-Neutered pokemon can breed. \"Neutered: Yes\" means that the pokemon cannot be used for breeding. \"Neutered: No\" means that the pokemon can be used for breeding |\n\n## How to Breed 6IV Pokemon\n\nFirst, take the egg group pokemon of your chosen pokemon and catch them. Make sure to get a female version of that pokemon so you can breed it properly. You can use the mentioned Egg Groups above to find a male parent. The more perfect IVs the pokemon has, the better.\n\nIf you want easier access to high IV pokemon, it's recommended to use Pokedollars to buy them off of GTS, as pokemon in each egg group is sold often. Make sure that the pokemon listed don't say \"Neutered: Yes\" when you buy them, as they are unbreedable. If it says \"Neutered: No\" then the pokemon can be used for breeding.\n\nOnce you have them, put them both in the daycare and let them start breeding.\n\n**Note:** Keep in mind that the species of the pokemon do not matter for the male pokemon, as long as they're in the same Egg Group, then they are compatible to breed together.\n\n### How IVs Work with Breeding\n\nWhen it comes to IVs, the parents' IVs are taken into account. The way this works is it will choose 3 IVs from either of the parents at random and apply them to the child, then it rolls the other 3 from 0-31.\n\n**Example:**\n\n| Pokemon | HP | ATK | DEF | SPATK | SPDEF | SPE |\n|---------|-----|-----|-----|-------|-------|-----|\n| Male Dratini | 4 | 31 | 0 | 25 | 13 | 31 |\n| Female Goomy | 31 | 1 | 20 | 30 | 21 | 0 |\n| Baby Goomy | 21 | 31 | 20 | 13 | 3 | 31 |\n\nAs you can see, it picks 3 random stats from the parents and then rerolls the other 3. The results will be different for each and every egg.\n\nYou are ideally looking for each stat to be 31 IVs for the male, but it's also ideal to change the male and female out for the baby if the baby's IVs are better.\n\nYou'll need to keep repeating this process until you get a male 6 perfect IV pokemon of said egg group. Once you've gotten it, then you can start breeding BP pokemon of that egg group. Keep repeating this process until you get each egg group.\n\n## Abilities\n\nEvery pokemon has an ability, but some pokemon can have more than 1, and almost all pokemon have a hidden ability, meaning that pokemon have up to 3 total abilities, 2 regular abilities, and one hidden ability\n\nWhen breeding pokemon that results in a pokemon that has more than 1 regular ability, you do not need to have either parent with the ability you want.\n\nWith hidden abilities however, the female parent will need to have the hidden ability in order for the child to have it, unless you use a male with a Ditto, then the male needs to have the hidden ability. If you're breeding with a pokemon that has no gender, the same rule applies with using a male pokemon. When breeding to pass down hidden abilities, it's only a 60% chance for the hidden ability to get passed down.\n\n### Finding Pokemon with their Hidden Ability\n\nWhen looking for pokemon with their hidden ability, you will either need to find a Non-Neutered one on the gts, obtaining the pokemon from Raids, Dungeons, Swarms, Space-Time Distortions, or by hunting in the wild. Each method has their different hidden ability chances, but for the sake of this guide, we will be focusing on hunting wild pokemon.\n\nWild pokemon by default have a 1/250 odds (0.4% chance) to have their hidden ability, but these odds can be increased by the following methods:\n\n- **Having a Mew on your shoulder**\n  - This increases your chances by 10%, making it 1/225 odds (0.44% chance)\n- **Having a catch combo of 50**\n  - This increases your chances by 40%, making your odds 1/150 (0.67% chance)\n  - Catch Combos are when you catch the same species of pokemon, increasing by 1 per catch, but breaks when you catch a different pokemon\n  - For example, if you have a catch combo for pikachu, catching a pichu will break your catch combo\n- **Origin rank and higher ranks**\n  - Also increase your hidden ability odds, doubling the chances of finding a wild pokemon with its hidden ability, making your odds 1/125 (0.8% chance)\n\nWith all of these methods of increasing your hidden ability chances, you can increase your chances to get as low as 1/67 (1.49% chance)\n\n## How to Breed BP Pokemon\n\nNow that you have your 6IV pokemon its time to start breeding for the **egg group** you have chosen!\n\nIn order to do this, you will need the following items:\n\n### Destiny Knot\n\nThis passes 5 IVs from the parents instead of 3, and can be obtained from dungeon chests, \"/warp mart\", or can even be crafted.\n\n- This item is an absolute must, and should always be used when breeding\n- Having both parents hold the destiny knot does not stack the effect, meaning you should always and only be using one destiny knot\n\n### Everstone\n\nThis item passes down the original nature from the parent holding it to the egg. Everstones are obtainable from killing Geodude.\n\n- This item is completely optional, and the nature can later be changed to another by using mints (this doesn't change the original nature)\n\n### Power Items\n\nThese items pass the respective IV Stat down to the baby 100% of the time for whatever parent holds it. The IV stat passed down via the respective power item will cause the destiny knot to only pick 4 stats instead of 5, but this will always guarantee which stat is getting passed down.\n\nHere is what the power items look like:\n\n| Color | Stat |\n|-------|------|\n| Green | HP |\n| Red | Attack |\n| Orange | Defense |\n| Pink | Special Attack |\n| Yellow | Special Defense |\n| Blue | Speed |\n\n### How to Equip Items\n\nIn order to use these items, you'll need to equip them to the parents before putting them into a daycare pen. To do this, follow these steps with the screenshots provided:\n\n1. **Step 1** - Send out the pokemon and press \"R\"\n2. **Step 2** - While holding the item in your main hand, shift and right click the pokemon\n3. **Step 3** - Click on the top right corner\n\nAfter completing these steps, you'll be able to see that the pokemon is holding an item from your party list on the left side of your screen, looking like this (Choice Band as the placeholder item):\n\nOnce you've given the items of your choice to them you can put them into the daycare. It is ideal to have the parent with the BEST IVs (6IV) to be holding the Destiny Knot and the one with the missing stat you want to be holding the Power Item if neither parent has 6 perfect IVs. If you want to keep the nature you can give them the Everstone, but its not recommended as Mints make the use of everstones useless.\n\n### Breeding Example with Destiny Knot\n\nHere is another example of possible results, this time with a Destiny Knot as one of the held items:\n\n| Pokemon | HP | ATK | DEF | SPATK | SPDEF | SPE |\n|---------|-----|-----|-----|-------|-------|-----|\n| Male Dratini | 4 | 31 | 0 | 25 | 13 | 31 |\n| Female Goomy | 31 | 1 | 20 | 30 | 21 | 0 |\n| Baby Goomy | 3 | 31 | 20 | 30 | 21 | 31 |\n\nAs you can see, it now chooses 5 random stats from each of the parents instead of 3. Keep in mind that the last stat will always roll between 0-31, resulting in 1/32 odds (3.13%) to get a 6 perfect IV pokemon from the egg, otherwise resulting in 5 perfect IVs\n\nAs you keep breeding the specific female, once the amount of perfect IVs are higher than before and the hatched pokemon is female, replace the current female with the better female. Keep repeating this process until you get the desired IVs you want.\n\n**Note:** Destiny Knot will still be able to choose the Power Item slot resulting in 2 random rolls instead of 1 with Power Item + Destiny Knot. This means you can get as low as 4 perfect IVs instead of 5 or 6.\n\n### Important Note\n\nYou do not need 6 perfect IVs for the majority of pokemon in the game. If you want to figure out how to build a pokemon properly, you can check for official pokemon via google with \"(Pokemon) Smogon\" and be sure to find the option that has \"SV\" in it. If not, then search for the most recent competitive history of the pokemon. If you have no idea what to look for via Smogon, you can go to the competitive channel and ask for the ideal IVs of that pokemon in there.\n\nFor custom pokemon, you can head on over to the competitive channel on Discord, and ask competitive players about them.\n\n## Breeding for Hidden Power\n\nHidden Power is a 60 base damage attack that changes its type depending on the user's IV spread. This means that it can be difficult to get the desired Hidden Power type for your pokemon, but it's not impossible.\n\nThere are 2 methods to get the Hidden Power type that you want:\n\n1. Continuously breeding until the IV spread aligns with the type you want\n2. Buying a Male parent that has the stat spread you're looking for or you can buy a 30IV Ditto of each stat\n\nIn order to breed for Hidden Power effectively, you should give the female a Destiny Knot and the Ditto a Power Item of that stat. Once you get that stat you want you move onto the next ditto and repeat the process until you get your desired Hidden Power type.\n\n**Notes:**\n- Hidden Power will always be shown as a Water Type move, even if you have a different type\n- When looking to teach your pokemon the Hidden Power TM at \"/warp tms\", search for it under the water TMs\n\n## Egg Moves\n\nEgg moves are exclusive moves that need to be given the method Cobblemon Delta implemented, you can find what egg moves your pokemon has via the \"learnt moves\" tab in the pokedex and left clicking on the arrows until you see the \"egg moves\" section. Use the screenshot below to find the moves tab:\n\nIn order to give your pokemon egg moves you need to give the pokemon that you want to have the move a **Mirror Herb**\n\n### Obtaining Mirror Herb\n\nYou can obtain a Mirror Herb by using a bag of Surprise Mulch on a Stage 0 Revival Herb. The final stage Revival Herb crop can be mutated into one of the 4 following crops:\n\n- Mental Herb\n- Power Herb\n- White Herb\n- Mirror Herb\n\n### Using Mirror Herb\n\nOnce you've gotten a Mirror Herb, make sure to give it to the pokemon you want to teach the egg move to. Next, find a Pokemon with the move that has the move via level up. Egg groups do not matter when using this method.\n\nYou can find a list of the pokemon with said move via resources like Bulbapedia and Pokemon Database. Make sure it has the move in one of its four move slots, then put both pokemon in the same daycare pen. Finally, immediately take them out asap with right click, and you'll be able to find the egg move in your pokemon's learnset. Any future eggs bred with this specific pokemon as one of the parents will always have the egg move.\n\n**Note:** You can use this method on all pokemon with egg moves, even if they're neutered.\n\n---\n\n## Frequently Asked Questions\n\n### How long does it take for an egg to be made?\n\nAll pokemon take 3 minutes to create an egg, regardless of the pokemon being bred.\n\n### How long does it take for an egg to hatch?\n\nIt takes 3-5 minutes for an egg to hatch, and the length depends on a pokemon's egg cycle. You can search for a pokemon's egg cycle via resources like Bulbapedia and Pokemon Database. Egg cycles of custom pokemon are the same as their official counterpart.\n\n### How do you change a pokemon's nature?\n\nYou can use nature mints to change a pokemon's nature. You can craft them using 3 leaves of the increasing stat, and 1 leaf of the decreasing stat. /warp berryfarm provides free mint leaves to be used.\n\nUse the chart below (color coded by mint leaf color) to understand each nature. Greyed out stats are neutral natures, meaning they offer no benefit or negative.\n\n| | ⬇️ Attack | ⬇️ Defense | ⬇️ Special Attack | ⬇️ Special Defense | ⬇️ Speed |\n|---|---|---|---|---|---|\n| **⬆️ Attack** | Hardy | Lonely | Adamant | Naughty | Brave |\n| **⬆️ Defense** | Bold | Docile | Impish | Lax | Relaxed |\n| **⬆️ Special Attack** | Modest | Mild | Bashful | Rash | Quiet |\n| **⬆️ Special Defense** | Calm | Gentle | Careful | Quirky | Sassy |\n| **⬆️ Speed** | Timid | Hasty | Jolly | Naive | Serious |\n\n### I used a mint, but why does it not show the new nature?\n\nThe nature displayed in your pokemon's summary will always by default show the original nature, but will change to be italicised like this if a mint has been used. You can see the new nature obtained by the mint by hovering over the nature, like with the screenshot below:\n\n### Can you get Ditto from breeding?\n\nNo, the only way to obtain Ditto is from the wild. Ditto are only used to help breed other pokemon.\n\n### What are the odds of breeding a shiny pokemon?\n\nThe base odds of breeding a shiny is 1/8000, and with the Origin rank or higher, the odds are 1/7168.\n"
  },
  {
    "id": 2,
    "slug": "catching",
    "title": "Catching Guide",
    "subtitle": "Catch Combos",
    "description": "Catch Combos are a streak of catching the same Pokemon over and over. Catching 10 Comfey will give you a 10 Comfey catch combo, but catching anything else will break this combo.",
    "author": "Astra",
    "body": "# Catching Guide\n\nSubmitted by Astra\n\n## Catch Combos\n\nCatch Combos are a streak of catching the same Pokemon over and over. Catching 10 Comfey will give you a 10 Comfey catch combo, but catching anything else will break this combo.\n\nEvery 10 catches of the same Pokemon will increase the shiny chance by 3%, and the hidden ability chance by 8% for that Pokemon. This maxes out at 50 catches, giving 15% boosted shiny chance, and 40% boosted hidden ability chance.\n\nAdditionally, spawns above the 50 catch combo mark will have a 10% chance of having 3 31 IVs, and spawns above the 60 catch combo mark will boost the chance of large and small sized Pokemon spawns.\n\nYou can check your catch combo at any time with `/catchcombo`\n\nNone of this has any effect on Ditto.\n\n**Disclaimer:** Catch Combos do NOT affect the spawn rate of that Pokemon. Attempting a catch combo of rare Pokemon can be tedious, but rewarding. It's recommended to not attempt catch combos if you want to catch Legendaries from Raids or Dungeons anytime soon, as catching anything else will break your chain.\n\n## Best Catching Options\n\nCatching Pokemon is easier when they're affected with a Status like Paralysis, Sleep or Freeze, and when their HP is low. False Swipe is a move that will always leave the target at 1HP, making it a great tool for catching. Having at least one of the following Pokemon will be valuable for getting your Catch Combo up, or for completing Dex tasks.\n\n### Parasect\n\nThe best option for catching, with access to Spore for 100% accurate sleep, False Swipe and Damp which prevents Pokemon from self-destructing on you. Worry Seed is also an option to check the opposing Pokemon's ability if you're Hidden Ability hunting.\n\n### Breloom\n\nGreat secondary option, with Technician and high base attack, it has one of the strongest False Swipes in the game, and access to Spore too. Can also run Poison Heal instead of Technician for recovery over time while catching something. Worry Seed is an option here too.\n\n### Gallade\n\nGood for longer battles, with access to Thunder Wave, Hypnosis, and Heal Pulse, healing the opponent and preventing them from KOing to Recoil. The Ring Target + Trick combo can be used to let Gallade hit Ghost types with False Swipe.\n\n### H-Decidueye\n\nBeing the only Pokemon with False Swipe and Scrappy, you can hit Ghost types with False Swipe but it doesn't have access to any good status moves.\n\n### Samurott\n\nSimilarly to Decidueye, Soak will turn the opponent into a Water type, letting Samurott hit Ghosts with False Swipe, but also suffers from a lack of status moves.\n\n### Porygon-2\n\nWhen hunting for Hidden Abilities, it's one of the most reliable Pokemon. Trace will copy the opponent's ability, checking each encounter for HA or not. Also has recovery and Thunder Wave to catch things with.\n\n### Smeargle\n\nShould be noted for being able to learn any move in the game, letting it run all the useful catching moves like False Swipe, Spore, Soak, Heal Pulse, Gastro Acid/Simple Beam etc. Its massive fault though is that it's extremely weak.\n\n## Best Pokeballs\n\nRealistically you can use any Pokeballs you want, whether you want them to match the Pokemon, or just use your favorite designs. The Pokeballs listed here will give you the easiest time catching Pokemon fast.\n\n### Ultra Ball\n\nWith a 2x catch rate, this has the highest rate of catch at the cheapest cost, Ultra Balls are easy access and are essentially given around for free thanks to being plentiful in high rank kits.\n\n### Quick Ball\n\nWhen used on the first turn, it has a 4x catch rate, which means you can enter battle, use a Quick Ball, and if it doesn't catch you can do `/endbattle` and then enter battle again until it works.\n\n### Dream Ball\n\nAlthough one of the more expensive options, they have a 4x catch rate while the opponent is asleep. If you're using Parasect or Breloom, these can be the best option to pair.\n\n### Repeat Ball\n\nUseful for catch combo's and dex tasks where you have to catch the same pokemon multiple times. It has a 3.5x catch rate on anything you've already caught before.\n"
  },
  {
    "id": 3,
    "slug": "claims",
    "title": "Cobblemon Delta Flan Basics Guide",
    "subtitle": "Making a Claim",
    "description": "Using the golden hoe you can right click in 2 opposite corners and it will claim the whole area above and below the area you claimed.",
    "author": "EclipseVoid",
    "body": "# Cobblemon Delta Flan Basics Guide\n\n*Made by EclipseVoid*\n\n## Making a Claim\n\nUsing the golden hoe you can right click in 2 opposite corners and it will claim the whole area above and below the area you claimed.\n\nYou can look at how many claim blocks you have just by holding a golden hoe, it will send a message in chat saying how many claim blocks you have in total, how many you have used, and how many you have remaining.\n\nYou should also leave some sort of indicator block such as a torch or wool to indicate where the corners of your claim is so you can easily resize it when you want to do that.\n\n## Setting Permissions for a Claim\n\nWhile standing inside your claim you can type the command `/flan menu` this will bring up a menu.\n\nClick on the beacon labeled **Edit Global Permissions**. These permissions will change the permissions for every player on the server that is inside of your claim. Click on the permission you would like to change until it says false or true depending on what you want other players to be able to do.\n\n## Trusting Players Into Your Claim\n\nWhile standing inside your claim you can type the command `/flan menu` this will bring up a menu.\n\nClick on the book labeled **Edit Permission Groups**. These allow you to add people to permission groups which pretty much means you can allow specific players to do different things than what you have set in your global permissions.\n\nYour claim will come with **Co-Owner** and **Visitor** but you can add more just by clicking the Anvil labeled **Add**, or remove ones by clicking the Redstone block labeled **Remove Mode** (set to true for remove mode and set to false to not be in remove mode).\n\n- Right click on a permission group to set the permissions for that claim group\n- Left click to add a player to the permission group\n- You can also do `/trust {username}` this will add someone to the Co-Owner Permission Group\n\n## Sub Claims\n\nSub claims are pretty much claims inside of a claim, you can set its own permissions separate from the main claim.\n\nYou can do this by typing the command `/flan switchMode` it will say \"editing mode with to SUBCLAIM\" if done correctly. Now with your golden hoe, do the same thing you did to make your main claim but this time do it inside of your main claim around the area you want to have this sub claim around.\n\nNow to set permissions please refer to the \"Setting Permissions for a Claim\" and \"Trusting Players Into Your Claim\" sections but this time stand inside of your subclaim while using the command.\n\nYou should also leave some sort of indicator block such as a torch or wool to indicate where the corners of your subclaim is so you can easily resize it when you want to do that. I suggest using a different block for each subclaim and different than your main claim.\n\n## Deleting a Claim\n\nThere are 2 different ways to do this:\n\n- Stand in the claim and type `/flan delete` (use `/flan deleteSubClaim` for subclaims)\n- Do `/flan menu` and click on the barrier labeled **Delete Claim**\n\nUse `/flan deleteAll` to delete all your claims (use `/flan deleteAllSubClaims` for all subclaims).\n\n## Resizing a Claim\n\nYou can resize a claim (or subclaim) by right clicking on the corners of your claim with your claiming tool and then right clicking again in the location you want to expand or shrink your claim to.\n\nYou can also use `/flan expand {number}` (replace `{number}` with a number like 10 for example) while standing in your claim and it will expand that many blocks.\n\n## Getting Claim Blocks\n\n- You can get 500 claim blocks from the event shop for 5 event points\n- You will also gradually get claim blocks when you play the game, so the more playtime you have the more claims you will have\n\n## Didn't Set a Home and Can't Get Back to Your Claim?\n\nIf this happens to you please contact a staff member or open a ticket. Please give us the coords of your claim so we can teleport you to your claim.\n\nYou can find the coords of your claim by running the command `/flan list`. When you run this command it will give you a list of all your claims and their coords (corner - corner).\n\n## How to Ban Players From Your Claim\n\n*Created by ValaMalDaran*\n\nSee the full guide: [Google Doc](https://docs.google.com/document/d/1T5QqGPfFvheG2KGegpEQO45BPTuj4ppMclkSdw8NJbE/edit?usp=sharing)\n\n---\n\nThese are just the basics, these are the main features you will be using while playing on Cobblemon Delta. If you have any questions about any of the other features please ask a staff member that is online or your fellow players.\n\n---\n\n# How to Ban a Player From Your Claim\n\n*By: ValaMalDaran*\n\nTo begin, open the `/flan menu` while standing in the claim you would like to ban someone from.\n\n### Step 1: Select \"Edit Permission Groups\"\n\n### Step 2: Select \"Add\" on the Anvil Symbol\n\n### Step 3: Create a New Permissions Group\n\nYou can name it whatever you want, but for sake of ease we'll call it \"Banned.\"\n\n### Step 4: Run the Command\n\nExit the `/flan menu` and enter the following command in chat. Keep in mind, if you did not name your group Banned, be sure to input the name in chat.\n\n### Step 5: Add Players to the Group\n\nReopen your `/flan menu` and navigate back to the Permission's Group Tab. Select the new group you made.\n\nSelect the anvil option to add a new player's name. Be sure to carefully type the player's name you wish to ban. Be sure to include any spellings, symbols, and capitalization.\n\nOnce complete, if done correctly, the player's head should now appear.\n\n---\n\nIf you experience any issues or need assistance with this, please feel free to make a ticket and staff can assist you further!\n"
  },
  {
    "id": 4,
    "slug": "client_mod",
    "title": "QOL Mods List",
    "subtitle": "Client-Side mods to improve QOL!",
    "description": "A list containing client-side mods that help improve with Quality of Life (QOL). If you have a suggestion for an edit, more information to add, or have a client-side mod you would like to see added onto the list, feel free to message the guide submitter, thejuicycaboosie, on Discord, or the staff that made the post.",
    "author": "b0fn/b00fn",
    "body": "# QOL Mods List\n\n**Client-Side mods to improve QOL!**\n\n*Submitted by: b0fn/b00fn*\n\nA list containing client-side mods that help improve with Quality of Life (QOL). If you have a suggestion for an edit, more information to add, or have a client-side mod you would like to see added onto the list, feel free to message the guide submitter, thejuicycaboosie, on Discord, or the staff that made the post.\n\nEver tabbed out of Minecraft and missed a whisper from someone on Cobblemon Delta? Missed a message due to chat messages moving so fast? Dropped an item worth 400k PokeDollars and lost it to the item and mob clear? Then you've found the right doc! This doc contains a list of client-side mods to improve your Quality of Life (QOL) on Cobblemon Delta! A Client-Side mod is a mod that changes your gameplay, and is typically made for convenience.\n\n## Important Notes\n\n- This is all on Modrinth, the most recommended moded Minecraft launcher from the Cobblemon Delta Staff\n- If you don't use Modrinth, then you will need to find out where and how you can download these mods on your own\n- Questions outside of Modrinth will not be answered\n- All mods are working as of Fabric version: 1.21.1\n- These mods are to be used while following the Cobblemon Delta rules, and neither will the Guide Submitter or Staff who posts/edits this guide will not be held responsible for you breaking any of the rules listed on the Delta Discord or from the /rules command on the server\n\n## Client-Side Mod List\n\n- **Command keys** by NotRyken\n  - Allows commands to be used at the press of a keybind.\n\n- **Full Brightness Toggle** by Serilum\n  - Fullbright (Night Vision)\n\n- **ChatNotify** by NotRyken\n  - Allows a ping in-game if a prompt of your selection is mentioned in chat. Highly configurable.\n\n- **ItemLocks** by Kirdow\n  - Allows users to lock hotbar-slots. Preventing accidental dropping.\n\n- **Cubes without Borders** by Kira-NT\n  - Makes Minecraft Borderless Fullscreen.\n\n- **TalkBubbles** by Globox1997\n  - Shows people's chat in live-time above their heads. Helps with keeping conversations of people nearby.\n\n- **Armor Hud** by SaolGhra\n  - Shows the Armor and the Durability in a vanilla-style, helps monitor what you wear.\n\n- **Chat Plus** by ebicep\n  - Helps with chat clutter. Highly configurable.\n\n- **60fy Viewmodel Customizer** by martin-stojanoski\n  - Allows users to customize the View-model of the player (hands and items) to their liking. Highly configurable.\n"
  },
  {
    "id": 5,
    "slug": "diance",
    "title": "Jewler Trade",
    "subtitle": null,
    "description": "So you want to get a Diancie but you don't know how? This guide goes through the details of how to go through the process of acquiring a Diancie.",
    "author": "Smudget",
    "body": "# Jewler Trade\n\n**Author:** Smudget\n\nSo you want to get a Diancie but you don't know how? This guide goes through the details of how to go through the process of acquiring a Diancie.\n\n## Getting Started\n\nFor starters, you need Carbinks... and lots of them.\n\nCarbink fusion requires two Carbinks (of the same tier) and produces one of the following:\n\n- A Carbink of the same tier (50% of the time)\n- A Carbink of the next tier up (20% of the time)\n- A Carbink of the next tier down (30% of the time)\n\nWhen applicable, nothing happens if this were to happen with tier 1 Carbinks.\n\nEach fusion costs $5000.\n\n## How do I effectively get lots and lots of Carbink?\n\nFortunately for you, Carbink is breedable! It belongs to the Mineral and Fairy Egg Groups.\n\nUnfortunately, despite being in two Egg Groups, it can only breed with Ditto as it is genderless.\n\nRegardless, this is the most effective way of getting Carbink, as they are a fairly rare encounter and relying on those alone will make this process exponentially more cumbersome and last way longer than it needs to. Which is why if you want to start this process, get a Ditto. It doesn't have to be a good one, as long as it's not neutered!\n\n## Where does Carbink even spawn?\n\nThey spawn most in Amethyst clusters, however they are influenced heavily by Diamond Ores! If you want to catch them yourself, you can go to `/warp carbink` as it is a large floor of diamond ores, which prompts the spawns of Glimmet, Sableye, Roggenrola, and of course, Carbink.\n\n## Will shiny Carbink matter?\n\nUnfortunately not. Fusing shiny Carbink will just remove the shininess from the resulting Carbink regardless if it was a success or not.\n\n## How do I actually fuse my Carbink?\n\nFusion is done at `/warp CarbinkFusion` where you will meet Brock!\n\nRight click him and the jewel trader / Carbink fusion UI will show up. This is where you put in your Carbink!\n\n*Image*\n\n## What are the Carbink tiers, and how many are they?\n\nThere are 6 tiers to this process, 4 of which are for Carbink, and the remaining two are for Diancie.\n\nAs a reminder, when fusing your Carbink:\n\n- 20% Progression step (Tier UP)\n- 30% Regression step (Tier DOWN)\n- 50% Stagnation step (No Change)\n\nIf your Carbink is tier 1 already, the regression step will not occur, resulting in an effective 80% stagnation step.\n\n## Can I get a shiny Diancie this way?\n\nShiny Diancie is a special case. In order to get it, you need two Diancie. The fusion has a 100% success rate, but requires $5,000,000 to perform!\n\nIf you're feeling lucky and/or patient, go for it! It's one hell of a trophy to have!\n\n## Fun Fact\n\nWhile shininess doesn't influence the result of a Carbink fusion, you can still get shiny Carbinks of higher tiers. Arguably those are far more impressive to get as they cannot be bred nor influenced in any way! If you have a shiny tier 2-4 Carbink, cherish it! \n"
  },
  {
    "id": 6,
    "slug": "dowsing",
    "title": "Dowsing",
    "subtitle": null,
    "description": "A general guide for dowsing in Cobblemon Delta, containing steps to dowsing and some information related to dowsing. If you have a suggestion for an edit, or more information to add, feel free to message the guide submitter, Van_Zakkart, on Discord, or the staff that made the post",
    "author": "Van_Zakkart/Shinigami_36",
    "body": "Dowsing\nBy Van_Zakkart/Shinigami_36\n\nA general guide for dowsing in Cobblemon Delta, containing steps to dowsing and some information related to dowsing. If you have a suggestion for an edit, or more information to add, feel free to message the guide submitter, Van_Zakkart, on Discord, or the staff that made the post\nLast updated:- May 26th 2025\n\nInterested in finding some items to use for yourself, sell to others, or use as general display? You've found the right guide! This guide will go into the steps of dowsing, teaching players what they need to start dowsing, where to dowse, and how to dowse.\nStep 1\nObtain a Dowsing machine from PokeStops at /spawn, /warp Areazero, /warp Entralink, or buy one from another player.\n\nStep 2\nGo to the location of choice. There's currently two different worlds that you can dowse in, each with their own loot pool (items that can be dowsed) for each method of dowsing available.\nAreaZero (A0) (/warp center[1 through 4]) http://wiki.cobblemondelta.com/areazero (Go to Ursaluna dowsing to see possible legendary/mythical pokemon from dowsing and their requirements.) (Genie bottles on top of Alpha kills can also be obtained from dowsing.)\nEntralink (/warp lab[1 through 6]) http://wiki.cobblemondelta.com/entralink (Currently Genesect Head, Torso and Legs are the only mythical currently possible from dowsing.)\nStep 3 \nWhile Holding the machine (NEEDS TO BE YOUR MAIN HAND), move around until a bar appears on the top of your screen, now go in the direction which fills the bar to almost full with only two “!!”. Riding a Pokémon can make this easier. When you are at two !! with a green bar an area of green particles should appear, if walked over you will gain the rewards.\n\n\nUnique Dowsing for Unique Dowsing Loot Pools\nInstead of the normal Beep sounds that come from the dowsing machine you will hear the pokemon growl:\nUrsaluna can be used in AreaZero (Both forms work.)\n\nObtained by finding it in the wild or using a Peat block on a Ursaring during a full moon.\nUrsanette can be used in Entralink\n\nObtained by beating at least 5 waves in the Ursanette fusion battle in Entralink.\nRotom dowsing\nAs of the recent update Rotom Dowsing form has been added, this is the equivalent of using a dowsing machine but without the need to hold it. You can obtain Rotom from Pokestops at a rare chance or buy one from gts. With Rotom Dowsing form all you need to do is crouch right click and press “Shoulder”.\n\n\nTip:\nRiding a pokemon even if not a dowsing mon will increase your hitbox making it easier to find them (as long as you don't get stuck on trees and such.)\n"
  },
  {
    "id": 7,
    "slug": "dungeon",
    "title": "Cobblemon Delta Dungeon Guide",
    "subtitle": null,
    "description": "A Guide for Dungeons on Cobblemon Delta, containing all the information I could think to put in here. If you have a suggestion for an edit, or more information to add, feel free to message me, LordVile1, on Discord, or comment on the community post.",
    "author": "LordVile1",
    "body": "# Cobblemon Delta Dungeon Guide\n\n**By: LordVile1**\n\nA Guide for Dungeons on Cobblemon Delta, containing all the information I could think to put in here. If you have a suggestion for an edit, or more information to add, feel free to message me, LordVile1, on Discord, or comment on the community post.\n\n## Dungeon Commands\n\nDungeons can be run with a party of up to 5 players. The \"host\" can create and disband a party using /party create and /party disband respectively. They can invite people to the party using the command /party invite [Username]. (This command also automatically creates a party.)\n\nThe other players can join this party with /party accept [Username], and leave with /party leave. Everyone has access to the other 3 commands: /party list, which list the usernames of the people in the party; /party tp [Username], allowing you to teleport to your party members without them having to accept your tpa; and /p [message] to message in the party chat, which can only be seen by those in your party. For example, customarily the host will ask \"ready?\" or \"r?\" before entering, and the same goes for before entering the boss fight.\n\nIf you ever get stuck, you can run the command /dungeon respawn to respawn at the start of the dungeon. This will not use up one of your lives. To end a dungeon prematurely, use /dungeon quit when running solo, or /dungeon forfeit when in a party.\n\n## Dungeon Keys\n\nIn the /dungeons menu, left-click on the key to open up the dungeon key shop. Here you can see all the available dungeons. Most of the time, there are 6 type-themed dungeons: Ice, Grass, Ground, Fire, Water and Electric Dungeons. Occasionally, seasonal dungeons appear: There was a Summer Dungeon in July, and a Halloween Dungeon in October. Trade in four of the respective dungeon key fragments for a dungeon key by left-clicking the key you wish to buy.\n\nKey fragments (\"frags\" for short) are obtained through a variety of methods. These include: rewards for raids and dungeons; dowsing in Ultra Space; buying dungeon key selectors in the eventshop; drop from Alpha Pokémon.\n\nOnly one key is required to start the dungeon for the whole party, only the host needs a key. Once you are ready to start, go back to the /dungeons menu, click on the green arrow, and then select the key for the dungeon you wish to run.\n\n## Dungeon Streaks\n\nYour dungeon streak is the amount of dungeons you have successfully completed in a row. The streak starts at 0, and goes up by 1 every time you beat a dungeon. If you reach a streak of 20, after completing the next dungeon, your streak will loop back to 1. If you fail a dungeon, your streak resets to 0.\n\nWhen entering a dungeon, the highest streak in the party is chosen to be that dungeon's streak. This scales up the chance to encounter Legendary, Hidden Ability and Shiny Pokémon. Additionally, Zarude can be found in Grass Dungeons at a 1/30 chance when running with \"Max Streak\". (Max Streak refers to a streak above 15, as that is where the odds max out.)\n\n| Streak | Legendary Chance | HA Chance | Shiny Chance |\n|--------|------------------|-----------|--------------|\n| 0-4    | 1/20             | 1/100     | 1/200        |\n| 5-9    | 1/16             | 1/75      | 1/150        |\n| 10-14  | 1/12             | 1/50      | 1/100        |\n| 15-20  | 1/8              | 1/25      | 1/50         |\n\n## Dungeon Objectives\n\nOnce you have entered a dungeon, 4 out of 6 possible objectives are generated, along with amounts associated with these objectives. Find/defeat the desired amount to complete the task. You can see these objectives, and the progress, on the right side of your screen. Alternatively, in case the list on your screen doesn't appear, use the command /dungeon progress.\n\nIf you are struggling to complete the objectives, use /dungeon quit. (Note this only works when you are alone in a dungeon, and this does reset your streak.) If your party collectively loses 10 lives, or you run out of time, you are kicked out of the dungeon. *Add Time to Player count ratio.\n\n### Gimmighouls\n\nGilded chests (see image) spawn across the dungeon. Most of the time these are regular loot chests. These can contain various food items like meat, melons, apples, golden apples and golden carrots, rare candy, some custom weapons and more. However, sometimes these can be chest form Gimmighouls in disguise. This will initiate a battle with a low level Gimmighoul. If you do not have a non-fainted pokémon, it becomes aggressive and will attack the player in regular PvE combat. As soon as the disguise falls, it is counted towards the task; defeating it is not necessary. Evolving Gimmighoul requires 999 Relic Coins. These can be obtained easily by running away from Gimmighouls until the battle ends (/endbattle doesn't work in dungeons), then killing them through regular Minecraft PvE. Puzzle chests, chests found at the end of parkour, puzzles or mazes, can never be Gimmighouls. These Puzzle chests will often include rarer items like fossils, netherite, diamonds and armor trims.\n\n### Gems\n\nGems spawn amongst other items (more on that later) in the aforementioned gilded chests. Place them in your inventory, and they'll vanish and be counted towards the task. The gems look different depending on the type of dungeon, displayed in that image below: from left to right: Ice, Grass, Ground, Fire, Water and Electric Gems. Puzzle chests and disguised Gimmighouls never contain gems. Dungeons usually contain a few spare gems, more than are necessary to complete the task.\n\n### Stakes\n\nStakes look like swords sticking out of the ground. They spawn spread out across the dungeon on the floor. Appearance varies based on dungeon type. Right-click to pick them up. Just like gems, spare stakes spawn in the dungeon.\n\n### Pokéloot\n\nPokéloots are poké balls found spread around the dungeon. Collect them by right-clicking them, causing them to drop an item on the floor. These are divided into 3 tiers: Poké Ball, Ultra Ball and Master Ball, containing increasingly better loot. The loot pool includes: XL and Rare Candy; Power Items; Revives and Max Revives and more. The loot pool for the Master Ball varies depending on dungeon type, with the following items being notable:\n\n| Dungeon Type     | Notable Loot                          |\n|------------------|---------------------------------------|\n| All Types        | Master Ball, Ancient Origin Ball, Nether Star, Trident, Dragon Eggs |\n| Ice Dungeon      | Ice Sword                             |\n| Grass Dungeon    | Blossom Boots, Ruinous Hoe            |\n| Ground Dungeon   | Gigaton Hammer, Ruinous Hammer, Cornerstone Mask |\n| Fire Dungeon     | Hearthflame Mask                      |\n| Water Dungeon    | Wellspring Mask                       |\n| Electric Dungeon | Stormpeak Mask                        |\n\nJust like gems and stakes before it, pokéloots also generate extras.\n\n### Alpha Pokémon\n\nLarge, aggressive Pokémon, referred to as Alphas, spawn throughout the Dungeon. These Pokémon must be beaten through regular Minecraft combat, so killed with your weapon of choice. These are the exact same as Alphas you might find in Area Zero or the Entralink. You can recognise them by their larger than usual size, lightning particles and the boss bar at the top of your screen. Some Alphas have an additional ranged attack along with their standard hits. Wyrdeer in Ice Dungeons can shoot shulker bullets, while some Alphas In Fire and Electric Dungeons launch fireballs or smite you with lightning respectively.\n\n### Guardians\n\nNPC trainers spawn across the dungeon. These trainers have a full team of level 100, EV trained Pokémon. These Pokémon, for the most part, reflect the dungeon's type. Any powerful BP Pokémon can be used to deal with these, although it would be easiest using any Pokémon with a type advantage or that are listed as Ubers or other high tiers. Press R on a guardian to challenge them to a battle. If you aren't confident you can beat the guardian, ask in your party chat for someone else to deal with it.\n\n## Boss Room\n\nUpon completion of the dungeon's objectives, one player must head towards the dungeon's boss room. It is easily recognizable by being the largest room on the map/minimap. Note you can still gather items from chests and pokéloot, so feel free to continue looking around. When close to the entrance, they are asked if they are ready for the fight. Clicking \"No\" closes that menu, reopen it by stepping away from the entrance and moving back. Before entering, check whether your party is ready.\n\nOnce the boss fight starts, one Pokémon will have a boss bar appear on top of your screen. That Pokémon is the boss, once it dies the dungeon ends. Other aggressive Pokémon also spawn within the boss room, killing them is not necessary for the completion of the dungeon. The boss has 2 phases, you have to clear it's health twice. In the second phase, stalactites begin to fall from the sky. These function the exact same as dripstone. However, for the water dungeon, which is flooded with water, there are strong currents instead.\n\n| Dungeon Type     | Possible Bosses                              |\n|------------------|----------------------------------------------|\n| Ice Dungeon      | Chien-Pao, Articuno, Glastrier, Kyurem       |\n| Grass Dungeon    | Wo-Chien, Tapu Bulu, Ogerpon, Zarude         |\n| Ground Dungeon   | Ting-Lu, Tapu Lele, Bloodmoon Ursaluna       |\n| Fire Dungeon     | Chi-Yu, Moltres, Entei, Spectrier, Reshiram  |\n| Water Dungeon    | Suicune, Tapu Fini, Lochtrier                |\n| Electric Dungeon | Zapdos, Raikou, Tapu Koko, Zekrom            |\n\nAfter killing the boss, you are transported back to the hub server. You are given a chance to catch the boss. This boss can be shiny and have its Hidden Ability, as shown in the table in the \"Dungeon Streaks\" section. It is invisible and uncatchable for everyone else. You also receive your other dungeon rewards. These can include: Pokédollars (Usually 15,000 or 25,000, rarely 70,000); Battle Points; Egg Vouchers; Vitamins; Artifact Parts and more.\n\n## What to Bring\n\n### Items and Gear\n\nYou will need a good armor set, for which I would suggest enchanted netherite. This is easily obtainable at /warp enchant, where you can grind the enchantments, while you can purchase netherite off other players. While Summer is better, it is nowhere near as easy to obtain. Previously an exclusive to the summer event, now it can be purchased in the event shop for a hefty sum of event points.\n\nA good weapon is another necessity, to deal with the boss battle and the Alphas. The best weapon for this is the Ultra Sword, obtained through the shop at /warp ultramegaloplis. The Gigaton Hammer is good for raw damage output, but takes a while to recharge. You can obtain it from Ground Dungeons. A bow can be useful against Alphas when you're unable to get up close. There are many other options, more than I could reasonably name here, so feel free to try other things out.\n\nA good source of food is handy, allowing you to remain at maximum saturation. I would suggest golden carrots. The farmer villagers at /warp enchant sell them for emeralds, easily obtained from the sugar cane and bamboo farms at that same warp.\n\nBeing able to heal quickly in the boss fight is also very useful. For this, you can use golden apples. You should accumulate quite a few from dungeon chests, usually more than enough to keep up with the amount you utilize. Handy items for this also include the Sun and Moon Flutes, providing Regeneration to the whole party.\n\nBringing healing items for your Pokémon is vital, especially if you're going to take on more than one guardian. Max Revives, Hyper Potions and Max Elixirs are great for this. Bring some Poké Balls for catching the boss at the end, and some Master Balls/Ancient Origin Balls in case it's something rare.\n\n### Shoulder Effects\n\nBringing one or two shoulder Pokémon can be quite helpful. You can see a full list in the wiki, at http://wiki.cobblemondelta.com/misc, within the \"Shoulder Effects\" section. Some of the best include Terapagos (Resistance) and Kubfu or Marshadow (Strength) and Tangled Time (Speed and Fire Resistance), although these three are quite expensive.\n\nFor Fire Dungeons, a Pokémon providing Fire Resistance is recommended (Magby or Tangled Time), while for Water Dungeons either Manaphy (Conduit Power, Dolphins Grace) or Phione (Water Breathing) is necessary. Alternatively, Fire Resistance or Water Breathing Potions can be used.\n\nSome parkour for puzzle chests are made a lot easier through the use of Jump Boost, provided by Drifloon and Buneary.\n\n### Pokémon\n\nThe main use of the Pokémon is the guardians. You'll generally do fine with any good Pokémon, feel free to look in #viability-rankings. Any highly ranked Pokémon, especially Ubers, should do well. It's especially helpful to have a Pokémon with a type Super-Effective against the dungeon's type. Feel free to post some sets and teams in the community post this guide is in.\n\nYou might also send one out and have it follow you around, helping you defeat the Alphas and dungeon boss. They function similar to wolves in regular Minecraft. Note only one Pokémon will attack your opponents, sending out your whole party is pointless, and will often result in more difficulty for you and your party.\n\n## Repairing Dungeon Weapons\n\nWeapons and tools obtained from dungeons can not be enchanted, and therefore Mending can not be applied onto them. To repair them, you need to go to the dungeon NPC at /warp dungeons. You will need to hold at least 2 Artifact Parts (obtained as a completion reward for dungeons and raids) in your off hand, and the item in your main hand. Shift and right-click the NPC to open the repair menu.\n"
  },
  {
    "id": 8,
    "slug": "fishing",
    "title": "A Cobblemon Delta Fishing Guide",
    "subtitle": null,
    "description": "This is a beginner's guide on Cobblemon Delta's fishing system. If you have any suggestions for edits, or more information to add, feel free to message the submitter Van_Zakkart or travis.mp4 on Discord, or the staff who maintain the post.",
    "author": "Van_Zakkart",
    "body": "# A Cobblemon Delta Fishing Guide\n\nCreated by Van_Zakkart - Maintained by travis_mp4\n\nThis is a beginner's guide on Cobblemon Delta's fishing system. If you have any suggestions for edits, or more information to add, feel free to message the submitter Van_Zakkart or travis.mp4 on Discord, or the staff who maintain the post.\n\nIn order to get started with fishing in Cobblemon Delta, you need only one component: a fishing rod! Delta houses custom fishing rods, with different obtainment methods and rewards with each rod. Remember to check out our wiki at http://wiki.cobblemondelta.com/fishing for more info as well!\n\n## Fishing Rods: A Man's Best Friend\n\n### The Old, Good, and Super Rods\n\nCan be obtained from the Fishing Shop, at /warp fish or located just inside the fishing hut in Area Zero! The Super Rod is needed in order to obtain Feebas-tier fish, such as Battlebond Greninja, Manaphy, Phione, and more!\n\n### The Fire Rod\n\nCan be obtained rarely from Fire Dungeon chests! This rod can only be used in lava, not water! This provides fish such as Chi-Yu, Chi-Yu Jump Variants, or Volcanion!\n\n### The Ice Rod\n\nCan be obtained rarely from Ice Dungeon chests! This provides fish such as Omega Battlebond Greninja, Delta Glimmora, and the item DNA Splicers! (Screenshot credits to PQTSkitts)\n\n### The Master Rod\n\nCan be obtained from completing 200 Pokedex Research Tasks! This rod is more powerful than the Super Rod, boosting shiny rate, hidden ability rate, rare fish rate, and slowing down the minigame making fishing easier! (Screenshot credits to ItsCalixer and Mr_Ukown)\n\n### Rod Enchantments\n\nThe only enchantment that works on Delta fishing rods is Lure! This will function as normal.\n\n## Location: Where The Bobber Flies\n\nAll you need to fish is a source of water, but some locations have their own unique catches! In the table below, you can see some examples of region/server-exclusive fish. Keep in mind that the general fishing pool can be caught in all servers, and what is listed below are exclusives. For more information, view our wiki!\n\n| Overworld | Area Zero | Entralink |\n|-----------|-----------|-----------|\n| No exclusives yet! | Terapagos | Shaykarp |\n| | Rogue Prince | |\n| | Manaphite | |\n\nThis is subject to updates as fishing and Cobblemon Delta grow!\n\nFor Area Zero, Delta has a dedicated fishing hut, just straight left of /warp center2! Players tend to gather around there and fish, so join in on the fun!\n\n## The Reel: Pulling In A Fish\n\nTo start, it's very similar to regular Minecraft. You will throw out your rod, and wait until a fish bites, shown by the particle effects - once you right click the reel it is when things get different!\n\nDelta's fishing minigame is simple: you left click to move the bar up, and it will fall back down. Clicking more than once will cause it to push up, while leaving it be for longer will cause it to fall farther back down. Your goal is to keep the green bar on the swimming fish for as long as you can. If you have played Stardew Valley, it's a very similar premise!\n\nThe faster the fish on your minigame bar, and the more erratic it swims, the rarer the pull, so keep an eye on how fast it's swimming!\n\n- **GOOD** - Keep the bar on the fish\n- **BAD** - Bar is not on the fish\n- **FEEBAS CATCH (RARE!)** - Fast, erratic fish movement\n\nCredit to: ABrickToTheHead\n\n**TIP:** STAY ON THE LEFT SIDE OF THE FISH. It's much easier to click to catch up, than it is to let go and slow down! You also tend to react a tad bit faster that way!\n\n## Fishing Accessories: A Man's Second Best Friend\n\n### Tackles\n\nBait is an important part of fishing, boosting all kinds of odds. Below you'll see a list of all the different Tackles, and their effects! Same tackles do not stack, but different tackles on the same rod do. For example, you cannot buy 2x Enigma Tackles to increase your bobber even more, but you can use both Enigma and Lansat to increase your odds while having a larger bobber. All Tackles can be purchased from /warp fish, and you can see their effects and prices below!\n\n| Tackle | Price | Effect |\n|--------|-------|--------|\n| Enigma Tackle | ₽30,000 | Doubles the length of your bobber during the fishing minigame! |\n| Lansat Tackle | ₽100,000 | Doubles your odds of finding a rare catch! |\n| Salac Tackle | ₽30,000 | Increases your bite-rate! |\n| Razz Tackle | ₽100,000 | Doubles your shiny rate! |\n| Cheri Tackle | ₽50,000 | Doubles hidden ability rate! |\n| Kelpsy Tackle | ₽20,000 | Increases the chances to fish up a Magikarp! |\n| Aguav Tackle | ₽60,000 | Increases your odds of fishing up items! |\n\n> **NOTE:** NORMAL BERRIES CANNOT BE USED AS A TACKLE! This is a base Cobblemon function that has been disabled in favor of Delta's fishing minigame! To receive any of the aforementioned benefits, you must purchase them from /warp fish.\n\n### Shoulder Pokemon\n\nCurrently, the only fishing shoulder Pokemon is Pyukumuku! Having a Pyukumuku on your shoulder boosts your fishing bite rate by 20%!\n\nCredit to: travis.mp4\n\n### Friends\n\nWhy not bring a few friends along to help you fish, and get rewarded for doing so? For each person within 50 blocks of you, the shiny rate is increased by 0.5%, with a max of 5% with 10 people around! This only counts people that are fishing around you (AFK people do not count, and remember that macroing is against the rules).\n\n## Tiers: Why's This Magikarp Blue?\n\nWhen you're fishing, you may notice that the Magikarps in the minigame seem to change speed from reel to reel, or sometimes, the super fast ones don't look like a Magikarp at all. This isn't a bug; this is what we call tiers! There are three tiers for Magikarp, and three tiers for Feebas!\n\nThese tiers are sorted by speed; the slowest tier of Magikarp is a Tier 1, medium speed is Tier 2, and fastest Magikarp is Tier 3. The slowest Feebas is Tier 4, medium speed is Tier 5, and fastest Feebas is Tier 6!\n\nThe speeds of your fish vary what Pokemon you can fish up. Check out the Frequently Asked Questions category to see what each Pokemon is sorted into! In addition, just below this is an embedded video demonstrating all of the different speeds of Magikarp (Feebas coming soon™)!\n\n**Magikarp Tiers: 1-3**\n\n## Frequently Asked Questions\n\n### The tackles won't get off my rod/keep stacking up. Does this do anything? Can I get rid of them?\n\nEvery time you add a tackle to your rod, it adds a new row to your fishing rod. It is strictly visual - you will only have the effect of ONE of those tackles. For example, if you just ran out of Lansat, and you buy another Lansat tackle, you will only have the effects of one Lansat, though it visually looks like two. This cannot be fixed/simplified.\n\n### I can't see the Magikarp/Feebas in the fishing minigame! How can I fix this?\n\nMake sure that your modpack is fully up to date. If your modpack is updated, and you are still experiencing issues, go into your resource packs and disable the Cobblemon Interface resource pack.\n\nCredit to: travis.mp4\n\n### What can you get from each Magikarp/Feebas tier?\n\nWhile there is no concrete resource to determine which Pokemon is in each tier, I have a sheet compiled with Pokemon I've tested to be in each one, such as Primarina in T3 Magikarp, or a Battlebond Greninja in a T4 Feebas. This is an active sheet; it will receive updates and changes. Message me on Discord if you want to see any additions to it!\n\n**A Fishing Guide: Tier Table**\n\nIt is important to note that I will not be adding exact fishing chances to this page. To see that, check out the Cobblemon Delta wiki page! You can see them by going to the Cobblemon Delta wiki here, clicking on Fishing, then clicking the Fishing Odds section, where you can sort by rod and area.\n"
  },
  {
    "id": 9,
    "slug": "fusion",
    "title": "Fusions",
    "subtitle": "A Player's Guide to Fusion Pokemon",
    "description": "A general guide for players wanting to learn how they can obtain different fusion pokemon. If you have a suggestion for an edit, or more information to add, feel free to message the guide submitter, TheJuicyCaboosie, on Discord, or the staff that made the post.",
    "author": "TheJuicyCaboosie/JuicyBlue",
    "body": "# Fusions\n\n**A Player's Guide to Fusion Pokemon**\n\n*Guide By TheJuicyCaboosie/JuicyBlue*\n\nA general guide for players wanting to learn how they can obtain different fusion pokemon. If you have a suggestion for an edit, or more information to add, feel free to message the guide submitter, TheJuicyCaboosie, on Discord, or the staff that made the post.\n\n## What are Fusion Pokemon?\n\nA Fusion Pokemon is the combination of two different pokemon to make one. There are some official ones, such as Kyurem-Black, Necrozma Dusk Mane, and Calyrex Shadow Rider, but we have far more custom ones, such as Ursanette, Armaledge, Zapeon and Radiant Moon.\n\nMost fusions are obtainable through collecting DNA and Dream Mist, but there are others that are currently unavailable, and this post will act as a guide in how to obtain the ones that we know of.\n\n## Entralink Fusions\n\nThese Fusion Pokemon all (almost) require DNA respective to their type, and Dream Mist to create Fusion Discs, afterwards needing to be used to engage in Fusion Battles or using them in the overworld to obtain the Pokemon.\n\n> **Note:** Fusion Battles require you to COMPLETE ROUND 5 (Reaching Round 6) in order to obtain the Fusion Pokemon. Fusion Pokemon that put you into Fusion Battles are specified.\n\n### 🐻👻 Ursanette 👻🐻\n\n- DNA Requirements: 16 Normal, 16 Ghost\n- Dream Mist Requirements: 5K\n- Fusion Battle\n\n### ⚡️🌼 Electisaur 🌼⚡️\n\n- DNA Requirements: 16 Electric and 16 Grass\n- Dream Mist Requirements: 10K\n- Fusion Battle\n\n### 🐈‍⬛️🌪 Lieslar 🌪🐈‍⬛️\n\n- DNA Requirements: 16 Dark and 16 Poison\n- Dream Mist Requirements: 10K\n- Fusion Battle\n\n### 🌨️🦊 Zorotales 🦊🌨️\n\n- DNA Requirements: 16 Normal and 16 Fairy\n- Dream Mist Requirements: 10K\n- Fusion Battle\n\n### 🎩☀️ Hatteon ☀️🎩\n\n- DNA Requirements: 16 Psychic and 16 Fairy\n- Dream Mist Requirements: 10K\n- Fusion Battle\n\n### 🎩🌑 Grimmeon 🌑🎩\n\n- DNA Requirements: 16 Dark and 16 Fairy\n- Dream Mist Requirements: 10K\n- Fusion Battle\n\n### 🗡🔫 Armaledge 🔫🗡\n\n- DNA Requirements: 64 Fire\n- Dream Mist Requirements: 15K\n- Fusion Battle\n\n### 🌋🐌 Magoodra 🐌🌋\n\n- DNA Requirements: 32 Fire and 32 Dragon\n- Dream Mist Requirements: 15K\n- Fusion Battle\n\n### 👻🌛 Clefgar 🌜👻\n\n- DNA Requirements: 32 Fairy and 32 Ghost\n- Dream Mist Requirements: 15K\n- Fusion Battle\n\n### 👻⚡️ Rotogar ⚡️👻\n\n- DNA Requirements: 32 Ghost and 32 Electric\n- Dream Mist Requirements: 15K\n- Fusion Battle\n\n### 🪙🔨 Gholdaton 🔨🪙\n\n- DNA Requirements: 32 Steel and 32 Fairy\n- Dream Mist Requirements: 20K\n- Fusion Battle\n\n### 🔩✈️ Archapult ✈️🔩\n\n- DNA Requirements: 48 Steel and 48 Dragon\n- Dream Mist Requirements: 20K\n- Fusion Battle\n\n### 🦖🦷 Scizantrum 🦷🦖\n\n- DNA Requirements: 48 Bug and 48 Rock\n- Dream Mist Requirements: 20K\n- Fusion Battle\n\n### 🐉🧊 Dragascue 🧊🐉\n\n- DNA Requirements: 48 Dragon and 48 Ice\n- Dream Mist Requirements: 20K\n- Fusion Battle\n\n### 💦🐕 Articeon 🐕💦\n\n- DNA Requirements: 64 Psychic and 64 Water\n- Dream Mist Requirements: 50K\n\n### ⚡️🐕 Zapeon 🐕⚡️\n\n- DNA Requirements: 64 Fighting and 64 Electric\n- Dream Mist Requirements: 50K\n\n### 🔥🐕 Molteon 🐕🔥\n\n- DNA Requirements: 64 Dark and 64 Fire\n- Dream Mist Requirements: 50K\n\n### 🌕🐲 Radiant Moon 🐲🌕\n\n- DNA Requirements: 64 Dragon and 64 Ghost\n- Dream Mist Requirements: 75K\n- Fusion Battle\n\n### ⏳️🤖 Valiant Time 🤖⏳️\n\n- DNA Requirements: 64 Fairy and 64 Steel\n- Dream Mist Requirements: 75K\n- Fusion Battle\n\n### 🧬🌑 Mewrai 🌑🧬\n\n- DNA Requirements: 96 Dark and 96 Psychic\n- Dream Mist Requirements: 100K\n- Fusion Battle\n\n### 🌠🌌 Cosmachi 🌌🌠\n\n- DNA Requirements: 192 Psychic DNA\n- Dream Mist Requirements: 100K\n\n### 🌸💎 Diancette 💎🌸\n\n- DNA Requirements: 96 Fairy and 96 Rock\n- Dream Mist Requirements: 100k\n- Eternal Flower Requirements: 50\n\n### 🌸🐟 Shaykarp 🐟🌸\n\n- Fish in Entralink with a Super Rod or Master Rod\n\n## DNA Splicers\n\nDNA Splicers can be obtained from fishing with an Ice Rod (Ice Rod can be obtained from Ice Dungeons).\n\n### ❄️⚫️ Kyurem-Black ⚫️❄️\n\n- Use DNA Splicers on Kyurem with Zekrom in your party\n\n### ❄️⚪️ Kyurem-White ⚪️❄️\n\n- Use DNA Splicers on Kyurem with Reshiram in your party\n\n### ☯️🐉 Kyurem-Origin 🐉☯️\n\n- Use DNA Splicers on Kyurem with Reshiram and Zekrom in your party\n\n## N-Solarizer and N-Lunarizer\n\nThe N-Solarizer and N-Lunarizer can be obtained from Meteor showers specifically in Ultra Wilds Biome, requiring the use of a Bloom/Mirror/Cyclone Memory, a Silvally and 10 fully charged Type Memories.\n\n### Necrozma Dusk Mane\n\n- Use an N-Solarizer on Necrozma with a Solgaleo in your party\n\n### Necrozma Dawn Wings\n\n- Use an N-Lunarizer on Necrozma with a Lunala in your party\n\n## Currently Unobtainable\n\n- Ultra Necrozma\n- Calyrex Shadow Rider\n- Calyrex Ice Rider\n"
  },
  {
    "id": 10,
    "slug": "nickname",
    "title": "Nickname Guide",
    "subtitle": "Basics",
    "description": "Anyone with Altered rank and above has access to the /nick command, but only Delta rank has access to colored nicknames. Delta nicknames don't have access to any other chat coding, like bold, italics, underline, or strike out. However, all nicknames can use unicode characters supported by Minecraft itself, including most emojis and a variety of different alphabets. Feel free to go wild with it, because you can always check what someone's actual name is by hovering over their nickname in chat.",
    "author": "Antler queen",
    "body": "# Nickname Guide\n\n**Author:** Antler queen\n\n## Basics\n\nAnyone with Altered rank and above has access to the /nick command, but only Delta rank has access to colored nicknames. Delta nicknames don't have access to any other chat coding, like bold, italics, underline, or strike out. However, all nicknames can use unicode characters supported by Minecraft itself, including most emojis and a variety of different alphabets. Feel free to go wild with it, because you can always check what someone's actual name is by hovering over their nickname in chat.\n\n**Disclaimer:** Some unicode characters are used as custom symbols and textures by the Delta server resourcepack and you'll be asked to remove them from your nickname.\n\n## Colored Nicknames\n\nYour number one friend when coming up with a colored nickname will be <https://webui.advntr.dev>. This site allows you to see a preview of how the colors will look without having to change your nickname. It's great for tweaking colors and making sure it's readable. Unfortunately it doesn't show all characters how they'll appear in chat, but it's a good resource nonetheless.\n\nAnother great site is <https://www.birdflop.com/resources/rgb/> which can autogenerate gradients for you, just make sure that the format is set to MiniMessage.\n\nThere are two codes to know when making a colored nickname; `<color:#000000></color>` and `<gradient:#000000:#ffffff></gradient>`. The color tags will make the text between them the color given in the `#000000` portion (called the hex color code), while the gradient tags will make the text between them transition between the two hex color codes provided. You can use as many as you want of both in your nickname, but how drastic the transition of a gradient will depend on the length of text in between the tags.\n\n## Formatting\n\nBelow are examples of different codes you can reference (and copy paste!) and attached are images of what each code will end up looking like in game.\n\n```\n/nickname <color:#57ebc8>Nickname</color>\n```\n\n```\n/nickname <color:#57ebc8>Nick</color><color:#126665>name</color>\n```\n\n```\n/nickname <gradient:#57ebc8:#126665>Nickname</gradient>\n```\n\n```\n/nickname <gradient:#57ebc8:#126665>Nick</gradient><gradient:#126665:#57ebc8>name</gradient>\n```\n\n## Other Resources\n\n- <https://lingojam.com/FancyLetters> - For fancy text\n- <https://emojipedia.org> - For emojis\n\nThere's no guarantee that all of these will work in the Minecraft chat, but most will!\n\nYou can also download Symbol Chat (linked below) if you don't feel like copying and pasting things from the above links, but don't feel like it's required!\n\n- <https://modrinth.com/mod/symbol-chat>\n"
  },
  {
    "id": 11,
    "slug": "start",
    "title": "Where to start?",
    "subtitle": null,
    "description": "A general guide for players starting out on Cobblemon Delta, containing suggestions on what to do and general information on certain topics and features. If you have a suggestion for an edit, or more information to add, feel free to message the guide submitter, thejuicycaboosie, on Discord, or the staff that made the post.",
    "author": "thejuicycaboosie/JuicyCaboosieOwO",
    "body": "# Where to start?\n\nA guide for new players!\n\n**Submitted by:** thejuicycaboosie/JuicyCaboosieOwO\n\n---\n\nA general guide for players starting out on Cobblemon Delta, containing suggestions on what to do and general information on certain topics and features. If you have a suggestion for an edit, or more information to add, feel free to message the guide submitter, thejuicycaboosie, on Discord, or the staff that made the post.\n\nSo you decided to join in on the fun on Cobblemon Delta! But where do you start? This guide is intended for brand new players and even those who want suggestions on how to get started on the server and what resources + guides you can utilise.\n\n## Picking your Starter\n\nThe first thing you should do when you join Cobblemon Delta is pick your Starter! Note that the starter you pick does not matter, though if you'd like to pick a starter that is competitively viable, here are some common starters seen in our meta as recommendations:\n\n- Charmander\n- Torchic\n- Mudkip\n- Hisuian Oshawott\n- Froakie\n- Litten\n- Grookey\n- Scorbunny\n- Sprigatito\n- Fuecoco\n- Delta Cyndaquil (Electric)\n- Delta Chimchar (Electric)\n- Ultra Snivy (Water)\n- Delta Sprigatito (Fairy)\n\nMost players stop using their starter and end up buying Battle Ready/Prepared (BP for short) Pokemon instead, and if you'd like a competitively viable starter that's also BP, it's recommended to buy one instead of using your base starter, as it's cheaper to buy one as opposed to BPing your pokemon, which on average would cost 2,250 BP (This is considered a lot for some regular players too).\n\n## Getting a Home\n\nThe next thing that you'll want to do is setting up a home and claim/flan! You can either do this yourself, or you can join a town! Do note that some towns require payment or rent to own a house that they may have already built, but since this guide is for new players, we recommend joining a town that would welcome you with no charges or you can build your own home!\n\nIf you decide to build your own home, you'll want to randomly teleport to an area in one of our world servers, from oldest to newest:\n\n1. Alpha\n2. Omega\n3. Gamma\n4. Epsilon\n5. Zeta\n\nAll servers excluding Omega are set to peaceful mode, whereas Omega is set to hard mode and can spawn hostile mobs such as zombies, endermen, creepers, etc. Zeta is our newest server, so it's also the most untouched, so if you're not looking to hassle yourself in finding a beautiful piece of land that isn't taken, we recommend Zeta, but you're free to start out on any server!\n\nOnce you've found a piece of land, the first thing you'll want to do is claim it! Use the following guide to help you out with creating a claim: https://discord.com/channels/511621928646344724/1335034551831105606\n\nAfter creating your claim, be sure to set a home in your claim with:\n\n```\n/sethome\n```\n\nThat command will set your default home, but if you wish to set a home with a name, use the following command:\n\n```\n/sethome [name]\n```\n\nYou'll be able to warp to any of your homes when setting it, and you can use the following command to warp back home:\n\n```\n/home [name (if you've set the home with a name)]\n```\n\nYou'll want a home to store items that you'll obtain on the server, including blocks, pokemon items, and items exclusive to the server like badges!\n\nAt this point, you're free to do as you wish! But there's so many things you can do, like challenging gyms, participating in events, completing daily activities, and much more! So what should you start doing? Here's a few things that we would recommend for new players to do!\n\n## Battle Factory\n\nBattle Factory is one of our features that require no resources whatsoever! It's also our only daily activity out of the two dailies that requires no resources! But what is the Battle Factory?\n\nIn the Battle Factory, you'll get to battle a gauntlet of trainers using 3 random rental pokemon, and if you reach far enough, you'll get rewards based on how far you get! We have 2 main modes: Standard and Endless, along with two difficulties for both: Standard and High.\n\n**Standard mode** is the daily mode, where you'll be tasked to defeat a gauntlet of 10 trainers, all of which are using a random set of pokemon from two specific pools of pokemon based on the difficulty you pick!\n\n> **Note:** You'll only receive a reward if you beat the first 4 rounds of Standard mode, but you'll be able to continue trying until you've beaten the first 4 rounds!\n\nThere's also a 3 minute cooldown when attempting to retry battle factory, but the cooldown begins the moment you start the first round! You get to attempt the Standard mode every 12 hours, each attempt refreshing at 6am and 6pm EST!\n\n**Endless mode** is the same as Standard with a few notable differences! The first being that instead of just 10 rounds, you keep participating in battles until you lose, hence being called Endless! You also get less rewards in Endless compared to Standard, getting rewarded after every 5 rounds. The other notable difference is that when you reach far enough in Endless mode, instead of waiting 12 hours to attempt it again, you'll only need to wait until the next hour!\n\n> **Note:** If you have any form of healing items for pokemon (potions, revives, elixirs) in your inventory, you will not be able to start and will have to wait until your 3 minute cooldown is up!\n\nWhen you're ready, be sure to warp to the Battle Factory with the following command:\n\n```\n/warp battlefactory\n```\n\nThis is just a few basic details on Battle Factory, and a more detailed guide will be linked when one's been made!\n\nNewer players are highly recommended to attempt the Standard mode daily, as you get rewarded a bit of PokeDollars, some BP, and some rare candies, which you'll want to use to prepare for the next recommended feature!\n\n## Raids\n\nRaids are the other daily feature that players can participate in! But what are Raids?\n\nRaids act similarly to dynamax adventures from the Crown Tundra DLC, where you'll be given 10 lives and need to battle 4 different pokemon after choosing a type among 4 choices! After defeating all 4 different pokemon and keeping enough lives, you'll face the boss of the raid, which have a 1/50 chance to be a legendary (Only encounterable in Hard Mode)! The boss will be completely random among all the possible raid pokemon that you can face in Raids!\n\nJust like Battle Factory, there are two difficulties to Raids: **Easy** and **Hard** Modes! In Easy mode, all the pokemon that you battle will be set to level 60, and in Hard mode, the pokemon will be set to 100! As mentioned earlier, legendary pokemon can only be encountered in Hard Mode!\n\nIf you lose all your lives at any point, you will fail the raid! If you defeat the boss, you'll receive rewards which include:\n\n- PokeDollars\n- BattlePoints\n- Egg Voucher\n- Vitamins\n- Dungeon Fragments\n- Master Ball\n- Artifact Part\n- Random shiny (chance)\n\nYou'll also be put into another battle with the boss pokemon and get the chance to catch it! This boss will be put at level 50 and is guaranteed to have 3 random perfect IVs!\n\nYou can participate in a raid in a party of up to 5 players, but all 5 players will share the same 10 lives! So why would you want to even participate in a raid with other players? If you're in a party of at least 3 players, including yourself, it increases the chance of encountering a legendary as the raid boss, changing from 1/50 to 1/30!\n\nYou'll get 3 raid charges to use every 12 hours, resetting at 6am and 6pm EST! And note that all players in a party need a raid charge in order to participate!\n\nIt's recommended to use level 100 pokemon when participating in a raid, and due to how difficult Hard Mode can be, there are recommended pokemon to use, including the sets that they have! Use the following thread to help you get a deeper understanding on Raids: https://discord.com/channels/511621928646344724/1339826591206867034\n\nWhen you're ready to start a raid, use the following command to open the raid menu:\n\n```\n/raids\n```\n\n## Making Money\n\nThere are many ways to earn money! Including:\n\n- Selling Items and certain pokemon drops\n- Completing Raids and Battle Factory\n- Completing Dungeons (Need Fully Enchanted Netherite Armor)\n- Defeating random NPCs found in Area Zero and Ultra Space (Requires BP level 100 pokemon)\n- Selling pokemon on the Global Trade System (GTS for short)\n- Complete Pokemon and Breeding Hunts (Requires the use of specific pokeballs for the more rewarding hunts)\n- Completing Pokedex Tasks\n- Beating Gyms (Requires BP level 100 pokemon)\n\nI'll slightly touch on each of the ways listed above besides Raids and Battle Factory so you can get a slight understanding of each method!\n\n### Selling Items and Pokemon Drops\n\nYou can just about sell any item you can get your hands on in Cobblemon Delta, but most of which requires the use of a chest shop or players that are interested in buying what you're selling! The very few items that do not require a chest shop and a buyer can be sold at `/warp shop` - where you can sell items like Rabbit Hide, Dragon Scales and Black Sludge to NPCs! To sell an item, be sure to not have a helmet on, hover over the item in the shop UI, and right click to sell!\n\n### Completing Dungeons\n\nYou can earn quite a lot of money from dungeons while getting some nice loot out of it too, including golden ingots, diamonds, and if you're lucky, some rarer loot like ogerpon masks, or even items that are unique to dungeons! You can also catch some legendary pokemon that you can either keep or sell to other players!\n\n### Defeating Random NPCs\n\nYou can find NPCs that you can battle with spawning randomly all around Area Zero and Ultra Space! Area Zero NPCs will always have 6 level 100 pokemon, all of which have held items like Life Orbs and Assault Vests. Ultra Space NPCs can be easier, as the levels their pokemon are scales, never being under level 50, and the amount of pokemon can also scale! Remember to wear your Ultra Space Armor or you'll die in Ultra Space! You can buy Ruby Armor for 5k per part (20k total) at `/warp ultraspace`.\n\n> 💡 **Useful Tip:** Put a Meowth on your shoulder before battling the NPC and make sure to not switch into it. This will double the amount of PokeDollars earned when defeating the NPC!\n\n### Selling Pokemon on the GTS\n\nAs mentioned earlier, you can sell pokemon to other players! There's two methods of doing this, the first requires both you and the buyer being online and on the same server, the buyer using the command:\n\n```\n/pay [player username] [amount]\n```\n\nAnd yourself using the command:\n\n```\n/pokegift [player username] [pokemon slot]\n```\n\nThere is a more ideal way of selling pokemon to players that doesn't require one player waiting on another, and that's with the Global Trade System (GTS)! The GTS allows you to post pokemon up for sale into an in-game marketplace! Any player can then buy the pokemon from the market, making this entire process not requiring both the seller and the buyer to be online at the same time! You can use the following command to upload the pokemon for sale:\n\n```\n/gts sell [pokemon slot] [amount]\n```\n\nAnd if the pokemon did or did not sell after 24 hours, you can claim the pokemon or the money with the following command:\n\n```\n/gts claim\n```\n\n> **Note:** There is a confirmation screen that shows you the pokemon you wish to sell and the amount you wish to sell it for, but you should still make sure you're not accidentally selling the wrong pokemon or for the wrong amount!\n\n### Complete Pokemon and Breeding Hunts\n\nOn each world server (and Area Zero) there are 2 sets of 6 different hunts to complete within a period of time!\n\n**Pokemon hunts** involve catching specific pokemon with specific abilities, IV percentage, and/or sometimes requiring being caught in a specific pokeball!\n\n**Breeding Hunts** require you to breed either any pokemon from a specific Egg Group, or a specific pokemon altogether, requiring specific Natures, IV percentages, and/or ability!\n\nIt's recommended to attempt to do the first two (from the top left) hunts, as they are typically the easiest to complete and have less requirements!\n\n### Completing Pokedex Tasks\n\nYou can also earn money from completing a pokemon's pokedex tasks! Every pokemon has it's own pokedex tasks that can be found by right clicking a pokemon while holding your poketch, or by using the following command:\n\n```\n/pokedex search [pokemon]\n```\n\nYou'll find the pokedex tasks of a pokemon when you hover over the pokedex icon to the left of the shown pokemon! If you're having trouble finding the tasks, use the following guide: https://discord.com/channels/511621928646344724/1335032594793889914\n\n### Defeating Gyms\n\nCobblemon Delta has our own gym system, where you can battle any of the 8 gym types of the season! Remember, the gym leaders aren't NPCs, they're players who are very experienced at battling and are using competitively viable teams! You ideally need a full team of level 100 BP pokemon and a good strategy in order to beat a gym leader!\n\nIf you manage to win, you'll be rewarded:\n\n- PokeDollars\n- BattlePoints\n- Rare Candies\n- The Gym Leader's Badge\n- Random shiny (chance)\n\nFor more information on Gyms, please head to the following channel: https://discord.com/channels/511621928646344724/1096629245473734756\n\n## Events\n\nServer Events are PvE minigames that any player can participate in! Best part about it? Regardless of how long a player has played on the server, there are no outside means of advantages besides knowledge and experience of playing the events (besides Catch Contest)!\n\nThese events are hosted at the following times:\n\n- 3pm EST/EDT (Currently EDT)\n- 9pm EST/EDT (Currently EDT)\n- 3am EST/EDT (Currently EDT)\n\nSpecific Staff will host the following based off of a schedule:\n\n| Event | Description |\n|-------|-------------|\n| 🧊 Avalugg Crush | Step on the Green Carpets and don't get crushed by the falling Avalugg! |\n| 🎣 Catch Contest | Catch as many different species of pokemon of a specific type before time runs out! |\n| 🕳️ Cave Escape | Jump your way up to the surface before time runs out! |\n| 🎮 PokeGames | Find Pokemon, get them ready, battle trainers, and be the last one standing! |\n| ❄️ Spleef | Don't fall into the Lava! Break snow blocks and drop others down! |\n| 🏃 Triathlon | Run, jump and fly through obstacles to make it to the end! |\n| ⚡ Voltorb Tag | Hide, run, or hit others with a voltorb! Don't get tagged before time runs out! |\n| ❓ Who's That Pokemon | Guess what pokemon other players are building, or build a pokemon and be as accurate as possible! |\n\nParticipating in Server Events rewards players with a currency exclusively from Events, **Event Points**! You can use Event Points to redeem different rewards from the Event Shop, such as master balls, claim blocks, random shinies, crate keys, and even items from our Seasonal Events! You can access the Event Shop with the following command:\n\n```\n/eventshop\n```\n\nAll Server Events will reward players who at least participate in them 5 Event Points! On events that have a finish line, so long as you reach the end, you'll earn at least 15 Event Points! Besides that, being in the top 10 of any Event will reward you at least 15 Event Points!\n\nRemember that these Events are optional, but it's the only way to earn Event Points!\n\n---\n\nIf you have any questions regarding anything that's been touched upon in this guide, you can check out guides that go into more detail, ask a staff member, or ask your questions in our questions channel or in game! These guides will be listed in the post that this guide is in, and as more guides get posted, they will be shared there!\n"
  },
  {
    "id": 12,
    "slug": "ultraspace",
    "title": "🌌 An Ultimate Ultra Space Guide 🌌",
    "subtitle": null,
    "description": "Welcome to Ultra Space! Get ready to embark on an exciting journey into a world filled with incredible discoveries and adventures. In Ultra Space, you'll encounter Ultra Pokémon, explore mysterious wormholes and nests, tackle Ultra Wild Nests, hunt for rare Nihilego loot, and even collect Silvally memories—plus so much more! This guide is here to help you navigate every corner of Ultra Space, making your experience both fun and rewarding. Let's dive in and see what Ultra Space has in store for you!",
    "author": "AmaTheGoodra",
    "body": "# 🌌 An Ultimate Ultra Space Guide 🌌\n\n**By: AmaTheGoodra**\n\nWelcome to Ultra Space! Get ready to embark on an exciting journey into a world filled with incredible discoveries and adventures. In Ultra Space, you'll encounter Ultra Pokémon, explore mysterious wormholes and nests, tackle Ultra Wild Nests, hunt for rare Nihilego loot, and even collect Silvally memories—plus so much more! This guide is here to help you navigate every corner of Ultra Space, making your experience both fun and rewarding. Let's dive in and see what Ultra Space has in store for you!\n\n## Getting Started\n\n📝 To get started, type `/warp ultraspace` in chat to teleport to our main Ultra Space Portal.\n\nOnce inside, your first and most important step is to speak to the nearby NPC and purchase a full set of Ruby Armor (5,000 Pokédollars per piece). Make sure you equip the entire set before exploring, as you cannot survive in Ultra Space without it!\n\n> **Note:** Ruby Armor is only effective in Ultra Space, and we do not recommend using it outside of Ultra Space.\n\n## What's Next?\n\nNow that you have your armor, your main journey can begin! Once you approach the NPC, you can look to your left and enter the portal. You'll be given two options:\n\n- Ultra Space\n- Ultra Megalopolis\n\nIf you choose **Ultra Space**, you'll be randomly teleported to one of several unique biomes, including:\n\n- Ultra Deep Sea\n- Ultra Jungle\n- Ultra Desert\n- Ultra Plant\n- Ultra Forest\n- Ultra Crater\n- Ultra Ruin\n- Ultra Burst\n- Ultra Grove\n- Ultra Oasis\n- Distortion (Note: This biome is at a lower Y level than all the others!)\n\nAlternatively, if you pick **Ultra Megalopolis**, you'll be transported to the city where you can start completing quests to raise your level in Ultra Space. Leveling up here is a major requirement for progressing further! You can also use the command `/warp UltraMegalopolis` to be placed right in front of the quest NPC, Phyco, to begin your adventure right away.\n\n## Ultra Megalopolis & Phyco - The Basics\n\n### Main NPC: Phyco\n\nYou'll spend a lot of time with Phyco! Talk to him to access three main options:\n\n### Levels\n\nThis is your main progression system in Ultra Space. To level up, complete Ultra Nests/Wormholes and collect special gems (check yours with `/gems`). Some levels also require you to complete a set number of Quests before you can advance!\n\n**Quest Milestones Needed for Levels:**\n\n| Level | Quests Required |\n|-------|-----------------|\n| 4     | 1 Quest         |\n| 6     | 5 Quests        |\n| 10    | 10 Quests       |\n| 14    | 15 Quests       |\n| 18    | 20 Quests       |\n| 22    | 25 Quests       |\n| 26    | 30 Quests       |\n| 30    | 35 Quests       |\n| 33    | 40 Quests       |\n| 38    | 45 Quests       |\n\n> **Note:** Some quests (like \"Hatch Rockruff Eggs,\" \"Dungeon Exploration,\" and \"Defeat Lusamine\") may not be available yet.\n\n### Quests\n\nQuests are essential for leveling up and sometimes come with rewards like money, Z-Crystals, and more! Click on a quest to teleport directly to the NPC needed to complete it.\n\n### Shop\n\nTrade in your hard-earned gems from Wormholes for powerful Ultra Space Gear! Gear is divided into 7 tiers (T1 Ruby up to T7 Ultra).\n\nYou can also:\n- Get Drives for Iron Pilot (available at level 32)\n- Obtain or Upgrade an Ultra Conduit, which lets you create a safe spot in Ultra Space (no gear needed while inside)\n\n> **Gear Reminder:** Only US Crossbows work in Ultra Space Wormholes, regular bows/crossbows won't!\n\n### Side NPC: Cozmo (Meteorite Trader)\n\nCozmo is where you go to trade Meteorites! Collect Meteorites by exploring or AFKing in Ultra Space—look for chat popups about meteor showers and listen for fireworks/explosions.\n\n**Trade them with Cozmo for points:**\n\n| Meteorite Type | Points |\n|----------------|--------|\n| Common         | 1      |\n| Uncommon       | 3      |\n| Rare           | 5      |\n| Mythical       | 25     |\n\n**Point Rewards:**\n- **25 Points:** Fill an Empty Hoopa Ring\n- **300 Points:** Obtain Deoxys\n\n> If you want to change Deoxys's form, right-click Deoxys with a Mythical Meteorite!\n\n### Need Quest Help?\n\nIf you get stuck, ask for help in the marketplace channel—generally, there's always an open ad for assistance with quests. Ultra Space is easier (and more fun!) with friends.\n\n## 🌪️ Wormholes & Nests ✨\n\nWormholes only spawn in Ultra Space, appearing on a random player at random intervals. When one spawns on you, you'll see a deep blue chat message. Look around carefully, as wormholes do not show on your map and despawn after 5 minutes.\n\n### Wormhole Tiers\n\nEach wormhole is a different tier (refer to the infographic for visuals).\n\n> **Note:** Tier 8 wormholes can only be spawned via Hoopa Rings.\n\n### Got a Wormhole? Here's What to Do:\n\nYou can tackle Tier 1 solo (Ruby Gear is sufficient). For any tier above T1, creating a party is highly recommended.\n\n**To form a party:**\n1. Use `/party create`\n2. Announce in chat: \"Tx Wormhole on me 1/5\"\n3. Invite players with `/party invite (username)` (hover over nicknames in chat to see real usernames)\n4. Once your group is ready, confirm in party chat with `/p` and check that everyone is ready before jumping in\n\n### Wormhole Nest Objectives\n\nYou'll start with a 30-second prep timer—use it to set up shoulder mounts for extra effects (send out Pokémon with R, shift-right-click, and select the prompt). See Misc Wiki for a list of useful shoulder abilities.\n\nWhen the timer ends, Pokémon waves will attack. Fight them with your sword (an Enchanted Netherite Sword is highly recommended—get upgrades at `/warp enchant` and craft using templates).\n\nDefeat enough Pokémon to either return (Tier 1) or start new waves (higher tiers). Win by clearing all waves before losing too many lives. You'll be returned to your last location if you succeed.\n\n### General Rewards\n\nCompleting a wormhole nest rewards you with gems, items, battle points, and a chance for an egg voucher!\n\n### Ultra Beast and Tier 7-8 Wormhole Rewards\n\nFor players aiming for Ultra Beasts, good news! Completing Tier 7 or Tier 8 wormhole nests gives you a shot at these rare Pokémon, but there are some special rules:\n\n- Ultra Beasts have a **20% chance** of being a reward in Tier 7, and a **50% chance** in Tier 8 (Tier 8 also offers a higher shiny chance!)\n\n**The Ultra Beast you encounter depends on the biome where you complete the nest:**\n\n| Ultra Beast | Biome |\n|-------------|-------|\n| Nihilego    | Ultra Deep Sea |\n| Buzzwole    | Ultra Jungle |\n| Pheromosa   | Ultra Desert |\n| Xurkitree   | Ultra Plant |\n| Kartana     | Ultra Forest |\n| Celesteela  | Ultra Crater |\n| Guzzlord    | Ultra Ruin |\n| Blacephalon | Ultra Burst |\n| Stakataka   | Ultra Grove |\n| Naganadel   | Ultra Oasis |\n| Giratina    | Distortion (requires Level 30+ in Ultra Space) |\n\n### Special Ultra Space Legends\n\n**Hoopa:** Reach Level 38 in Ultra Space and get a Prison Bottle (drops from Nihilego) for a chance to battle Hoopa. Be careful—Hoopa is very strong and can one-shot you!\n\nTo get a Tier 8 nest, you'll need a Hoopa ring, fill it at the Cozmo NPC, and right-click it in the correct biome. This will give you a random chance (between Tier 5 and 8) to spawn a wormhole, with Tier 8 giving the highest Ultra Beast odds.\n\n> **Bonus:** Want a chance at better-tier wormholes? Place a Hoopa on your shoulder!\n\n## 🐙 Nihilego Loot\n\nNihilego Loot works similarly to Drifblim Loots in Area Zero! There are three tiers, which you can identify by the color of the box that Nihilego is holding:\n\n| Tier | Box Color |\n|------|-----------|\n| 1    | Gray      |\n| 2    | Pink      |\n| 3    | Blue      |\n\nWhen they spawn, they will show up on your map as a dot named \"Nihilego.\" You can shoot it down with a bow, use fusion to hit it with a sword, or use an Ultra Elytra as well!\n\nNihilego Loot has a chance to give gems, memories (including special ones), Hoopa Rings, and more! You can also obtain a new enchantment exclusive to Nihilego Loot—the **Singularity Enchantment Book**. This enchantment can only be found in Nihilego Loot in Ultra Space, NOT in Ultra Wild. Singularity works like Infinity, but for crossbows.\n\n> **Note:** No matter if you are playing alone or in groups, the spawn chance will remain the same.\n\n## 🧬 Silvally Memories & Information\n\n### How to Obtain Silvally\n\nYou can obtain Type:Null by completing the Beast Killer quest. This involves giving Gladion all 17 type memories (excluding Normal), which can be collected as Nihilego loot or purchased from other players.\n\n### To Evolve\n\nRaise Type:Null's friendship by feeding it berries (Tamato or Pomeg) available at `/warp berryfarm`. Once friendship is high enough, Type:Null will evolve into Silvally.\n\n### Silvally Memories\n\n**Charge Mechanic:**\n\nMemories are initially uncharged, indicated by `0/20 charges`. To charge a memory:\n\n1. Equip the desired memory to your Silvally\n2. Catch 20 Pokémon of the memory's corresponding type\n3. Upon meeting this requirement, Silvally will consume the memory\n\n**Progression:**\n\nAfter Silvally has consumed 10 memories, it will be at full charge. This fully charged state allows you to access the Ultra Wilds (details on this will be provided below).\n\n## 🌳 Ultra Wilds\n\n### How to Access\n\nTo start an Ultra Wild Nest, you must have a fully charged Silvally and give it a Bloom, Mirror, or Cyclone Memory. These memories are obtainable from Nihilego loot. Once Silvally is holding the chosen memory, bring it to Aether Paradise and give it to the corresponding NPC. The memory will be consumed, and Silvally's charges will reset to 0.\n\n### How They Work\n\nUltra Wild Nests are solo events. There are no waves—Pokémon continuously spawn around you. The goal is to defeat the aggressive Pokémon that appear. Since you will be swarmed, it is highly recommended to have Ultra Armor. You have 10 lives in an Ultra Wild Nest. If you lose all 10 lives, you will be ejected from the Ultra Wild Nest and forfeit any rewards.\n\nTo complete an Ultra Wild Nest, you must reach 500 Ultra Energy. After reaching this requirement, you may leave the Ultra Wild whenever you wish, but it is often beneficial to stay until your timer runs out to collect additional loot. If you want to exit early, use the command: `/ultrawild quit`.\n\nSuccessfully completing an Ultra Wild Nest guarantees you the related Ultra Beast and additional random loot items from the Nihilego Loot pool.\n\n**Ultra Wild Rewards:**\n- **Florizim** can be obtained from Ultra Bloom\n- **Wisphir** can be obtained from Ultra Cyclone\n- **Glimmerix** can be obtained from Ultra Mirror\n\n### Notes\n\n- Nihilego Loot and Meteor Showers spawn much more frequently in the Ultra Wild\n- Some loot items are exclusive to Ultra Wild Nests, such as the **N-Solarizer** and **N-Lunarizer**. These can be found in Meteor Showers in the Ultra Wild and are used to fuse Solgaleo and Lunala with Necrozma to create Dusk Mane Necrozma and Dawn Wings Necrozma\n- Two unique enchantments can be found in the Ultra Wild:\n  - **Aether Chain (I-III)** and **Aerial Bounty (I-II)** Enchantment Books can be obtained from Nihilego Loot\n  - Aether Chain slows down Nihilego and Drifloot\n  - Aerial Bounty increases the amount of items you receive from them\n  - Both enchantments are for bows\n\n## Aether Paradise\n\nFaba is an NPC at the Aether Foundation who allows you to infuse custom Ultra Beasts into your Aether Armor, as well as obtain the armor itself. You can also check your quest progress with him.\n\nFaba offers the best armor for Ultra Space—it's even better than Tier 7, although it is quite a grind to obtain. You'll need 400 Ultranium (100 for each armor piece). The base armor is stronger than Tier 7, and it has the unique ability to fuse the three custom Ultra Beasts: Florazim, Glimmerix, and Wisphir, into it.\n\n**Here are the effects they add:**\n\n| Ultra Beast | Effect |\n|-------------|--------|\n| Florazim    | When you attack mobs or aggressive Pokémon, they are poisoned |\n| Glimmerix   | If you drop below 10 HP, you gain Resistance 3 for a few seconds (40-second cooldown) |\n| Wisphir     | When you are hit, a wind charge is automatically launched toward the attacker |\n\n> **Note:** Wisphir's effect is currently bugged and does not work as intended.\n\nYou must infuse all three Ultra Beasts into the armor to breathe in Ultra Space, and doing so will consume the Ultra Beasts. The armor is also enchantable.\n\n## ⚔️ Ultra Space Trainers\n\nWhile exploring or AFKing in Ultra Space, you may encounter Pokémon Trainers. These trainers can spawn near you, and they are also visible on the map. To begin a battle with them, simply right-click them. Be careful, as their teams are strong, so it is best to come prepared. Bringing Pokémon with the best IVs, full EV training, and at level 100 will help you succeed in these battles.\n\nDefeating these trainers rewards you with Pokédollars and also gives you a chance to receive an Eternal Flower. You will need to collect 10 Eternal Flowers and give them to AZ to complete one of your Ultra Space Quests.\n\n## Legendary Pokémon\n\n### Solgaleo and Lunala\n\nSolgaleo and Lunala spawn on a random person in Ultra Space every six hours. After one spawns, there is a six-hour cooldown before another appears. This pattern repeats continually. When one spawns, you will see a message that says, \"A [Solgaleo/Lunala] has spawned.\" However, unless you see the boss bar, the spawn did not occur on you. If you defeat them with weapons, you will be put into a battle with Cosmog, which you can then catch. To evolve Cosmog into Solgaleo or Lunala, you will need a Sun Flute or Moon Flute. These flutes can be obtained by dowsing, nihiloot, or by purchasing them from other players.\n\n> **Note:** There is no visible timer showing when the next Solgaleo or Lunala will spawn.\n\n### Necrozma\n\nYou can obtain Necrozma by reaching Ultra Space level 31 and collecting seven Eclipse Shards. These shards can be obtained from players, dowsing, or wormholes. Once you have seven Eclipse Shards, go to Phyco at `/warp ultramegalopolis` and click on the quest book to catch Necrozma. Each account can only obtain one Necrozma.\n\n### Tapu Kehe\n\nYou can obtain Tapu Kehe from Bloom Ultra Wilds.\n\n### Cresselia\n\nYou can obtain Cresselia from Mirror Ultra Wilds.\n\n### Azelf\n\nYou can obtain Azelf from Mirror Ultra Wilds.\n\n### Mesprit\n\nYou can obtain Mesprit from Bloom Ultra Wilds.\n\n### Uxie\n\nYou can obtain Uxie from Cyclone Ultra Wilds.\n\n### Mewthree\n\nYou can obtain Mewthree from Cyclone Ultra Wilds.\n\n### Giratina\n\nTo catch Giratina, you need to reach level 30 in Ultra Space. Then, complete a Tier 7 or higher wormhole in Ultra Space Distortion for an encounter with Giratina.\n\n> **Note:** To obtain Origin Form Giratina, you will need a Griseous Core. You can get this item by completing Distortion Biome events at Tier 7 or higher. Then, right-click Giratina with the Griseous Core to change its form.\n\n## 📎 General Information & Extra Details\n\nYou can comfortably handle Tier 1–3 wormholes with Ruby armor, especially if you are exploring with others. For higher tiers, it is strongly recommended to ask someone with higher-tier armor to assist you. Ideally, you should work on upgrading your armor. The best way to do this is by completing wormholes until you can reach Tiers 4–6, at which point you can obtain those armors. You may also purchase armor from other players, but remember that you still need to complete quests and wormholes yourself to progress. Simply owning Tier 7 armor does not guarantee success.\n\nYou can receive gem rewards from any tier, regardless of your progression level. For example, you are eligible for Tier 7 rewards from Tier 7 wormholes, even if you are only Tier 1 in terms of progression.\n\nNihilego fusion is another reward you can obtain. This allows you to breathe in Ultra Space and gives you access to a special dash ability, which you can bind in the controls menu. You must have Nihilego mounted on your shoulder to use this ability.\n\n## ❓ FAQ ‼️\n\n**Q: What shoulder effects does Nihilego or Poipole provide?**\nA: Please see http://wiki.cobblemondelta.com/misc for full details. Use Left Shift to activate the Nihilego dash.\n\n**Q: What counts as a \"Banned Platform\" in Ultra Space?**\nA: A banned platform is any floating structure in the sky built solely for gaining spawns, dowsing, or meteorites. Building for aesthetic purposes is fine, and flattening land is also acceptable. If you spot a banned platform, please create a ticket in 🎫｜create-a-ticket and report it.\n\n**Q: What are the easiest quests to do?**\nA: Ease of quests depends on what you already have and your current progress. You may ask for suggestions in chat or refer to the relevant posts, but please do not spam or annoy others with repeated requests.\n\n**Q: How big can I make my land?**\nA: There is no size limit on claims in Ultra Space. Make your land as large as you wish; there is no required size to maximize spawns, meteorites, or other features.\n\n**Q: Can I ban people from my claim?**\nA: No. Banning other players from your Ultra Space claim is generally not allowed under the server rules. If you're experiencing an issue with a player, make a ticket, and a staff member can assist you further.\n\n**Q: What is a Distortion Biome?**\nA: Distortion Biomes are unique to Ultra Space. You can locate them by traveling down along the Y-axis. For more information, visit http://wiki.cobblemondelta.com/ultraspace\n\n**Q: Where do wormholes spawn?**\nA: Wormholes spawn near players.\n\n**Q: Do wormholes show up on the map?**\nA: No, they do not appear on the map.\n\n**Q: How long does it take for wormholes to spawn?**\nA: Wormhole spawns are random and may appear for any player at any time.\n\n**Q: Does the spawn biome matter for Solgaleo or Lunala?**\nA: No, the spawn biome does not affect them.\n\n**Q: How do I get a Red Chain?**\nA: Catch Mesprit, Azelf, or Uxie in the Ultra Wilds biome they appear in. Each catch gives a one-in-four chance to receive a Red Chain.\n\n---\n\nIf you have any other questions, you can always ask in ❓｜questions for help or advice.\n"
  },
  {
    "id": 13,
    "slug": "armor",
    "title": "Armor Guide",
    "subtitle": "Best Armor",
    "description": "- **Tier 8 (T8)** - Best overall, allows breathing in Ultra Space",
    "author": "LLM",
    "body": "# Armor Guide\n\n## Best Armor\n\nThe best armor sets are:\n- **Tier 8 (T8)** - Best overall, allows breathing in Ultra Space\n- **Summer Armor** - High tier, event exclusive\n- **Spring Armor** - High tier\n\nIf you want to explore Ultra Space without swapping armor, T8 is recommended as it provides breathing capability.\n\n## Getting Started\n\nFor new players, enchanted Netherite armor is sufficient for dungeons. Obtain it at `/warp enchant` where you can grind enchantments and trade for gear.\n\n## Ultra Space Armor\n\n- **Ruby Armor** - Entry level for Ultra Space, buy at `/warp ultraspace` (5k per piece)\n- **Aether Armor** - Best Ultra Space armor, obtained from Faba at `/warp aetherfoundation`\n"
  },
  {
    "id": 14,
    "slug": "battle_points",
    "title": "Battle Points",
    "subtitle": "How to Earn Battle Points",
    "description": "Battle Points (BP) can be earned from:",
    "author": "LLM",
    "body": "# Battle Points\n\n## How to Earn Battle Points\n\nBattle Points (BP) can be earned from:\n- `/raids`\n- `/dungeons`\n- `/battlefactory`\n- Spectating gym battles\n\n## Where to Spend Battle Points\n\n- `/warp battleshop` - Ability patches, bottle caps, and more\n- `/warp tms` - Purchase TM moves\n- `/warp dojo`\n- `/warp coffeeshop`\n- `/warp energyshop`\n\n## Ability Patching\n\nAt `/warp battleshop`, you can use an Ability Patch to change a Pokemon's ability to its Hidden Ability. This costs Battle Points and makes the Pokemon unbreedable.\n\n## Bottle Caps (Hyper Training)\n\nAt `/warp battleshop`, talk to the NPC to hyper train your Pokemon's IVs using Battle Points.\n\n## One-Time IV Fix\n\nUse `/fixivs (slot)` once per Paradox, Ultra Beast, or Legendary Pokemon to fix its IVs. This can only be used once per eligible Pokemon.\n\n## Trading Battle Points\n\nYou cannot directly pay someone Battle Points. To trade BP value, you must purchase items for each other.\n"
  },
  {
    "id": 15,
    "slug": "commands",
    "title": "Useful Commands",
    "subtitle": "Money and Trading",
    "description": "| `/pay (player) (amount)` | Send money to another player |",
    "author": "LLM",
    "body": "# Useful Commands\n\n## Money and Trading\n\n| Command | Description |\n|---------|-------------|\n| `/pay (player) (amount)` | Send money to another player |\n| `/balance (currency type)` | Check your balance for a specific currency |\n| `/gts sell (slot) (price)` | List a Pokemon for sale on the GTS |\n| `/gts claim` | Collect money/Pokemon from GTS and shop chests |\n| `/buy` | Opens link to purchase credits |\n\n## Pokemon Management\n\n| Command | Description |\n|---------|-------------|\n| `/pokegift (player) (slot)` | Gift a Pokemon to another player |\n| `/show (slot)` | Display a Pokemon in chat |\n| `/rideablepokemon` | See which Pokemon you can ride |\n| `/resetev (slot) (stat)` | Reset a specific EV stat on a Pokemon |\n| `/fixivs (slot)` | One-time IV fix for Paradox/UB/Legendary Pokemon |\n| `/unbreedable (slot)` | Neuter a Pokemon (make it unbreedable) |\n\nTo ride a Pokemon, right click its hitbox after sending it out.\n\nTo give a Pokemon a held item, Shift + Right Click the Pokemon while holding the item.\n\n## Chat Commands\n\n| Command | Description |\n|---------|-------------|\n| `/p (message)` | Send a message to your party |\n| `/d (message)` | Send a message to Delta chat (no toggle) |\n\n## Navigation\n\n| Command | Description |\n|---------|-------------|\n| `/rtp` | Random teleport to the wild |\n| `/sethome (name)` | Set a private home |\n| `/home (name)` | Teleport to your home |\n| `/setwarp (name)` | Create a public warp (costs 100k) |\n\n## Miscellaneous\n\n| Command | Description |\n|---------|-------------|\n| `/catchcombo` | Check your current catch combo |\n| `/checkcompletion` | Claim rewards for completed bingo tasks |\n| `/supporter monthly` | Claim monthly supporter rewards |\n| `/supporter daily` | Claim daily supporter rewards |\n| `/pokedex search (pokemon)` | Look up Pokemon information |\n| `/dungeons` | Open dungeon menu |\n| `/raids` | Open raid menu |\n| `/gyms` | Open gym menu |\n| `/eventshop` | Open event shop |\n"
  },
  {
    "id": 16,
    "slug": "crates",
    "title": "Crate Keys",
    "subtitle": "How to Use Keys",
    "description": "Use your crate keys at `/warp crate`.",
    "author": "LLM",
    "body": "# Crate Keys\n\n## How to Use Keys\n\nUse your crate keys at `/warp crate`.\n\n## How to Get Crate Keys\n\nCrate keys can be obtained from:\n- Event Shop (using Event Points)\n- Giveaways\n- Online credit shop\n\n## Plush Crate Keys\n\nPlush keys can be obtained from:\n- Online credit shop\n- Game Corner coins\n- Rare chance when interacting with a Poke Stop\n"
  },
  {
    "id": 17,
    "slug": "egg_vouchers",
    "title": "Egg Vouchers",
    "subtitle": "Claiming Your Eggs",
    "description": "After rolling egg vouchers at the Egg Machine:",
    "author": "LLM",
    "body": "# Egg Vouchers\n\n## Claiming Your Eggs\n\nAfter rolling egg vouchers at the Egg Machine:\n\n1. Return to the Egg Machine\n2. Click the **Ticket Icon** (not the green roll button)\n3. This opens your egg storage\n4. Click on eggs to claim the Pokemon inside\n\nYour egg backpack has a limit. If full, newly prepared eggs cannot be added until you make space.\n"
  },
  {
    "id": 18,
    "slug": "hard_dungeons",
    "title": "Hard Dungeons",
    "subtitle": "Requirements",
    "description": "To run hard mode dungeons, you need a **Catalyst**.",
    "author": "LLM",
    "body": "# Hard Dungeons\n\n## Requirements\n\nTo run hard mode dungeons, you need a **Catalyst**.\n\n## Creating a Catalyst\n\n1. Obtain a **Prismatic Frag** and an **Oreheart**\n2. Go to `/warp Outpost2`\n3. Combine them to create a Catalyst\n\n## Using the Catalyst\n\nKeep the Catalyst in your inventory when starting a dungeon. A message will prompt asking if you want to run hard mode.\n"
  },
  {
    "id": 19,
    "slug": "masterballs",
    "title": "Master Balls",
    "subtitle": "How to Get Master Balls",
    "description": "Master Balls can be obtained through:",
    "author": "LLM",
    "body": "# Master Balls\n\n## How to Get Master Balls\n\nMaster Balls can be obtained through:\n- Master Ball Pokeloot in dungeons\n- Defeating Alpha Pokemon\n- Dowsing in Area Zero\n- Killing Driftloot in Area Zero\n- Event Shop (`/eventshop`)\n- Crafting\n"
  },
  {
    "id": 20,
    "slug": "mega_evolution",
    "title": "Mega Evolution",
    "subtitle": "How to Mega Evolve",
    "description": "Mega Evolution can only be used in battle. When you get into battle, there is a mega evolution button below your moves. Click it, then select a move.",
    "author": "LLM",
    "body": "# Mega Evolution\n\n## How to Mega Evolve\n\nMega Evolution can only be used in battle. When you get into battle, there is a mega evolution button below your moves. Click it, then select a move.\n\nYou cannot mega evolve outside of battle.\n\n## How to Get Mega Stones\n\nMega stones can be obtained through:\n- Drifloot/Driftblimps in Area Zero\n- Dowsing in Area Zero\n- NPC or player shops\n\n## Rayquaza\n\nRayquaza requires a special quest to unlock its mega evolution. Complete the mission at `/warp rayquazaquest`.\n"
  },
  {
    "id": 21,
    "slug": "pokedex",
    "title": "Pokedex Tasks",
    "subtitle": "What Are Pokedex Tasks?",
    "description": "Every Pokemon has research tasks you can complete for rewards. View them by:",
    "author": "LLM",
    "body": "# Pokedex Tasks\n\n## What Are Pokedex Tasks?\n\nEvery Pokemon has research tasks you can complete for rewards. View them by:\n- Using `/pokedex search (pokemon)` and hovering over the pokedex icon\n- Right-clicking a Pokemon while holding your Poketch\n\n## Task Rewards\n\nSome tasks give immediate rewards upon completion.\n\n## Milestone Rewards\n\n| Tasks Completed | Reward |\n|-----------------|--------|\n| 200 | Master Rod |\n| 500 | Shiny Celebi |\n\nAdditional milestone rewards exist beyond these.\n"
  },
  {
    "id": 22,
    "slug": "raids_info",
    "title": "Raid Information",
    "subtitle": "Raid Reset",
    "description": "Raids reset at 12:00 AM EST every day. You receive 3 raid charges that refresh at 6am and 6pm EST.",
    "author": "LLM",
    "body": "# Raid Information\n\n## Raid Reset\n\nRaids reset at 12:00 AM EST every day. You receive 3 raid charges that refresh at 6am and 6pm EST.\n\n## Raid Requirements\n\n- You need exactly 3 Pokemon in your party\n- Certain moves are banned (such as Curse)\n- All party members need a raid charge to participate\n"
  },
  {
    "id": 23,
    "slug": "sandwiches",
    "title": "Sandwiches",
    "subtitle": "How to Get Sandwiches",
    "description": "Sandwiches cannot be crafted. You must kill Alpha Pokemon to get sandwiches as drops.",
    "author": "LLM",
    "body": "# Sandwiches\n\n## How to Get Sandwiches\n\nSandwiches cannot be crafted. You must kill Alpha Pokemon to get sandwiches as drops.\n\nAlpha Pokemon can be found in the wild or during swarms. Note that Alphas in Entralink do not drop sandwiches.\n\n## Shiny Sandwiches\n\nShiny sandwiches boost the shiny rate for a specific Pokemon type. To make a shiny sandwich:\n\n1. Go to `/warp sandwich`\n2. Combine 2 unique Herba Mysticas with the sandwich type you want to boost\n"
  },
  {
    "id": 24,
    "slug": "servers",
    "title": "Server Information",
    "subtitle": "Available Servers",
    "description": "All servers share the same data and features with one exception:",
    "author": "LLM",
    "body": "# Server Information\n\n## Available Servers\n\nAll servers share the same data and features with one exception:\n\n- **Alpha, Gamma, Epsilon, Zeta** - Peaceful mode (no hostile mobs)\n- **Omega** - Hard mode with hostile mobs (zombies, creepers, etc.)\n\n## Server Resets\n\nThe server never resets. Your claims, Pokemon, and progress are permanent. If you take a break and return, everything will still be there.\n\n## Keep Inventory\n\nKeep inventory is enabled on all servers. You will not lose items when you die.\n\n## Player Data Reset\n\nYou cannot reset your player data.\n"
  },
  {
    "id": 25,
    "slug": "shops",
    "title": "Chest Shops",
    "subtitle": "Creating a Shop Chest",
    "description": "2. Hold the item you want to sell in your hand",
    "author": "LLM",
    "body": "# Chest Shops\n\n## Creating a Shop Chest\n\nTo create a chest shop:\n\n1. Place a chest\n2. Hold the item you want to sell in your hand\n3. Shift + Left Click the chest\n\nThis will create a shop where other players can buy your items.\n\n## Claiming Shop Money\n\nTo collect money from your shop sales, use:\n\n```\n/gts claim\n```\n\nThis command also retrieves unsold Pokemon from the GTS after 24 hours.\n"
  },
  {
    "id": 26,
    "slug": "special_pokemon",
    "title": "Special Pokemon",
    "subtitle": "Meltan and Melmetal",
    "description": "To evolve Meltan into Melmetal:",
    "author": "LLM",
    "body": "# Special Pokemon\n\n## Meltan and Melmetal\n\nTo evolve Meltan into Melmetal:\n\n1. Use `/pokedex search meltan` to view the research task\n2. Catch 100 Meltan\n3. You will be awarded a Meltan Box\n4. Use the Meltan Box to evolve Meltan into Melmetal (one-time use)\n\n## Koraidon and Miraidon\n\nTo obtain Koraidon or Miraidon:\n\n1. Obtain a Korai Key or Mirai Key (rare dungeon reward, or buy from players)\n2. Catch 100 Paradox Pokemon in `/warp areazero` to fill the key\n3. Use the filled key to encounter Koraidon/Miraidon\n\n## Ash-Greninja (Battle Bond)\n\nBattle Bond Greninja can be caught by fishing with a Super Rod, Master Rod, or Spectral Rod at \"Feebas level\" spawn (fast, erratic fish in the minigame).\n\nBattle Bond works like pre-Gen 9: Greninja transforms into Ash-Greninja in battle.\n"
  },
  {
    "id": 27,
    "slug": "terastallization",
    "title": "Terastallization",
    "subtitle": "How to Terastalize",
    "description": "1. Gather all types of Tera Shards",
    "author": "LLM",
    "body": "# Terastallization\n\n## How to Terastalize\n\nTo terastalize your Pokemon:\n\n1. Gather all types of Tera Shards\n2. Give them to Professor Turo at the Tera Outposts\n\nOnce unlocked, you can terastalize your Pokemon in battle.\n"
  }
]